{"data":[{"id":35,"title":"Programming Languages: Application and Interpretation","edition_statement":"Version Second Edition","volume":null,"copyright_year":2007,"ISBN10":"0073523399","ISBN13":null,"license":"Attribution-NonCommercial-ShareAlike","language":"eng","description":"Unlike some other textbooks, this one does not follow a top-down narrative. Rather it has the flow of a conversation, with backtracking. We will often build up programs incrementally, just as a pair of programmers would. We will include mistakes, not because I don't know the answer, but because this is the best way for you to learn. Including mistakes makes it impossible for you to read passively: you must instead engage with the material, because you can never be sure of the veracity of what you're reading. At the end, you'll always get to the right answer. However, this non-linear path is more frustrating in the short term (you will often be tempted to say, “Just tell me the answer, already!”), and it makes the book a poor reference guide (you can't open up to a random page and be sure what it says is correct). However, that feeling of frustration is the sensation of learning. I don't know of a way around it. At various points you will encounter this: ExerciseThis is an exercise. Do try it. This is a traditional textbook exercise. It's something you need to do on your own. If you're using this book as part of a course, this may very well have been assigned as homework. In contrast, you will also find exercise-like questions that look like this: Do Now!There's an activity here! Do you see it? When you get to one of these, stop. Read, think, and formulate an answer before you proceed. You must do this because this is actually an exercise, but the answer is already in the book—most often in the text immediately following (i.e., in the part you're reading right now)—or is something you can determine for yourself by running a program. If you just read on, you'll see the answer without having thought about it (or not see it at all, if the instructions are to run a program), so you will get to neither (a) test your knowledge, nor (b) improve your intuitions. In other words, these are additional, explicit attempts to encourage active learning. Ultimately, however, I can only encourage it; it's up to you to practice it. The main programming language used in this book is Racket. Like with all operating systems, however, Racket actually supports a host of programming languages, so you must tell Racket which language you're programming in. This textbook has been used in classes at: Brown University, Cal Poly, Columbus State University, Northeastern University, NYU, Reed College, UC-San Diego, UC-Santa Cruz, University of Rhode Island, University of Utah, Westmont College, Williams College, Worcester Polytechnic Institute.","contributors":[{"id":1984,"contribution":"Author","primary":true,"corporate":false,"title":"Dr","first_name":"Shriram","middle_name":null,"last_name":"Krishnamurthi","location":"Brown University","background_text":"Shriram Krishnamurthi is Associate Professor of Computer Science at Brown University."}],"subjects":[{"id":3,"name":"Computer Science","parent_subject_id":null,"call_number":"QA76","visible_textbooks_count":137,"url":"https://open.umn.edu/opentextbooks/subjects/computer-science-information-systems"}],"publishers":[{"id":37,"name":"Brown University","url":"http://www.cs.brown.edu/~sk/Publications/Books/ProgLangs/2007-04-26/","year":2017,"created_at":"2018-09-07T17:22:36.000Z","updated_at":"2020-11-15T06:39:47.000Z"}],"formats":[{"id":51,"format":"Online","url":"http://www.cs.brown.edu/courses/cs173/2012/book/","price":{"cents":0,"currency_iso":"USD"},"isbn":null},{"id":52,"format":"PDF","url":"http://www.cs.brown.edu/courses/cs173/2012/book/book.pdf","price":{"cents":0,"currency_iso":"USD"},"isbn":null},{"id":53,"format":"Hardcopy","url":"http://www.lulu.com/spotlight/sk2","price":{"cents":2784,"currency_iso":"USD"},"isbn":null}],"rating":"4.5","textbook_reviews_count":1,"reviews":[{"id":834,"first_name":"Sanjay","last_name":"Rajopadhye","position":"Professor","institution_name":"Colorado State University","comprehensiveness_rating":5,"comprehensiveness_review":"The text is very comprehensive in the coverage of programming languages and in particular their implementation, although relatively little attention is paid to parsing -- the author is very clear about this choice, and I agree with it.\n","accuracy_rating":5,"accuracy_review":"The content is error free, as far as I could judge","relevance_rating":4,"relevance_review":"The principles covered in the text are definitely of primary concerns of programming language design and will remain relevant in the foreseeable future of computing.\n","clarity_rating":4,"clarity_review":"The text is lucid and most concepts a re clearly articulated and explained well","consistency_rating":5,"consistency_review":"The theme, terminology and framework adopted in the book are consistent.","modularity_rating":5,"modularity_review":"The modularity is very good.  Unlike other texts, the good *does not* follow a linear structure and encourages the student/reader/instructor to navigate it using their preferences.  Despite this dynamic flow of control, the book remains surprisingly modular and consistent.\n","organization_rating":4,"organization_review":"The organization and structure follows from the author's choice of a non-linear flow through the book, and yet the topics are presented in logically and clearly ","interface_rating":4,"interface_review":"The interface and navigation on the web site is very good and supports the non-linear flow","grammatical_rating":5,"grammatical_review":"The grammar and language is excellent.","cultural_rating":5,"cultural_review":"I did not find the text to be insensitive or offensive an any manner","overall_rating":9,"overall_review":"None","created_at":"2016-12-06T00:00:00.000Z","updated_at":"2016-12-06T00:00:00.000Z"}],"url":"https://open.umn.edu/opentextbooks/textbooks/programming-languages-application-and-interpretation","updated_at":"2024-10-21T13:00:23.000Z"},{"id":144,"title":"Programming Fundamentals - A Modular Structured Approach using C++","edition_statement":null,"volume":null,"copyright_year":2013,"ISBN10":null,"ISBN13":null,"license":"Attribution","language":"eng","description":"Programming Fundamentals - A Modular Structured Approach using C++ is written by Kenneth Leroy Busbee, a faculty member at Houston Community College in Houston, Texas. The materials used in this textbook/collection were developed by the author and others as independent modules for publication within the Connexions environment. Programming fundamentals are often divided into three college courses: Modular/Structured, Object Oriented and Data Structures. This textbook/collection covers the first of those three courses. The learning modules of this textbook/collection were written as standalone modules. Students using a collection of modules as a textbook will usually view it contents by reading the modules sequentially as presented by the author of the collection. The learning modules of this textbook/collection were, for the most part, written without consideration of a speci??c programming language. In many cases the C++ language is discussed as part of the explanation of the concept. Often the examples used for C++ are exactly the same for the Java programming language. However, some modules were written speci??cally for the C++ programming language. This could not beavoided as the C++ language is used in conjunction with this textbook/collection by the author in teaching college courses.","contributors":[{"id":3164,"contribution":"Author","primary":true,"corporate":false,"title":null,"first_name":"Kenneth","middle_name":"Leroy","last_name":"Busbee","location":"Houston Community College","background_text":"Kenneth Leroy Busbee, M.Acc. (Master of Accountancy), Brigham Young University. Teaches programming topics including courses in COBOL, main frame IBM assembly, Intel assembly, Pascal, \"C\" and \"C++\"; Business Computer Applications; Principles of Accounting."}],"subjects":[{"id":3,"name":"Computer Science","parent_subject_id":null,"call_number":"QA76","visible_textbooks_count":137,"url":"https://open.umn.edu/opentextbooks/subjects/computer-science-information-systems"},{"id":59,"name":"Programming Languages","parent_subject_id":3,"call_number":"QA76","visible_textbooks_count":26,"url":"https://open.umn.edu/opentextbooks/subjects/programming-languages"}],"publishers":[{"id":250,"name":"OpenStax CNX","url":"http://cnx.org/content/col10621/latest/","year":null,"created_at":"2018-09-07T17:22:38.000Z","updated_at":"2018-09-07T17:22:38.000Z"}],"formats":[{"id":520,"format":"PDF","url":"http://cnx.org/contents/MDgA8wfz@22.2:YzfkjC2r@17/Preface","price":{"cents":0,"currency_iso":"USD"},"isbn":null},{"id":521,"format":"Online","url":"http://cnx.org/contents/MDgA8wfz@22.2:YzfkjC2r@17/Preface","price":{"cents":0,"currency_iso":"USD"},"isbn":null}],"rating":"4","textbook_reviews_count":9,"reviews":[{"id":954,"first_name":"David","last_name":"McPherson","position":"Instructor","institution_name":"Virginia Tech","comprehensiveness_rating":4,"comprehensiveness_review":"The book covers all the major topics of C++ up to the C++98 standard.  It does have a nice index and table of contents that allows you to find a topic quickly and move to the module quickly.  I did not see a glossary.","accuracy_rating":4,"accuracy_review":"The book is accurate, albeit dated.  ","relevance_rating":2,"relevance_review":"The content is dated and this is one of the major drawbacks.  I teach in an older style and I was glad to see that it showed an older model; however it hasn't been updated in a while.  The online version was published in 2013, but I think the original was published in the late 90s.  I was looking for the copyright date, but I couldn't find it when I was typing this.  \n\nThe reading list is several editions out of date and the book makes no mention of any of the C++11 or C++14 standards.  The changes made to C++ in those standard changes really need to be included in a modern C++ text or it is seriously out of date.","clarity_rating":5,"clarity_review":"I like the book's writing style and I find it very clear.","consistency_rating":5,"consistency_review":"The book is very consistent.  It follows a good style of writing and is easy to follow.","modularity_rating":4,"modularity_review":"The book is modular but it's hard to assign the modules out of order due to the fact that the nature of a programming text will build off previous modules.  This is extremely typical of all programming texts.  ","organization_rating":3,"organization_review":"I disagree with the flow of topics.  I understand why they have chosen to introduce the topics in the way they have but I don't think this is the best way.  I prefer to forestall an in-depth discussion of functions until after loops and selection.  Selection and loops come very late in the topic list in my opinion.","interface_rating":5,"interface_review":"The interface is clean, clear and easy to use.","grammatical_rating":5,"grammatical_review":"The book has very good grammar.","cultural_rating":5,"cultural_review":"The book is not culturally insensitive.","overall_rating":8,"overall_review":"The book is okay.  I don't think I would use this book in my class because there are some major issues with how the examples are developed and the topic flow.  Since the modules are sequential it be too hard to rearrange and keep the content clear to the students.  Also the examples show the use of global variables which, in my opinion, should be avoided and I teach that in my class, so a text that shows examples using global variables would pose a major issue.  \n\nIn general I feel the book needs a major revision to include more modern C++ standards, a topic flow alteration and the removal of global variables in examples.","created_at":"2017-02-09T00:00:00.000Z","updated_at":"2017-02-09T00:00:00.000Z"},{"id":1419,"first_name":"David","last_name":"Smith","position":"Instructor","institution_name":"Portland Community College","comprehensiveness_rating":4,"comprehensiveness_review":"The book does a good job of covering the first term of a programming class.  It covers the basics of programming but it's not a perfect fit for a one-term only programming class. Some of the topics not covered are: multidimensional arrays and structs,  anything beyond the basic arithmetic operators, output formatting, using library functions for advanced math and bitwise operations.  I agree with the idea of leaving out object oriented programming (classes).  \n\nAlthough every important feature was discussed, I feel like any adopter would want to supplement with more examples.  The book doesn't have much in the way of code tracing examples and additional code examples.  It's not always the best approach for students, but students often solve programming problems by searching for a code fragment that they think solves their problem instead of creating the code fragment by themselves.  I would provide additional code fragment examples.\n\nI also feel like there's not enough emphasis on functions. I think it's fine to introduce functions early but they should be revisited after covering structured programming when students can deal with larger blocks of code and see the benefits of functions.\n\nI feel like introducing recursion to the average student (especially community college students) is not helpful.  So it's fine to have it in there but I wouldn't hesitate to skip it.\n\nThere was no index or end of book glossary although it is searchable (the pdf has an index).  On the other hand, each module has a definitions section.","accuracy_rating":5,"accuracy_review":"The book follows the C++ standard.  I haven't checked every example but I noticed one example that wouldn't compile because it was missing a library include statement.","relevance_rating":4,"relevance_review":"It's not stated which C++ standard is supported although it's obviously C++98.  There have been a few important updates to the standard since the text was written but at this level, I don't think it impacts the material or examples very much, although anyone who adopts the text would need to scrub all the examples and add a section on the changes to the spec.","clarity_rating":5,"clarity_review":"The text is written in a clear style although some of the module titles could be more clear - for example \"program control functions\" and \"Specific Task Functions\" seem obfuscated to me.  Supporting context is at a minimum, which is a choice of style.  Some books surround the code examples with historical context and philosophical context.  This book is about the basics.","consistency_rating":5,"consistency_review":"The structure and style of the text was consistent throughout.  The book follows the form of presenting a text description with pseudocode, then the C++ structure and then one or two example code fragments.  Each major section has a practice programming exercise.","modularity_rating":4,"modularity_review":"I think this question applies better to textbooks from other subjects like history or economics.  The book is modular in the sense that each module is broken down into easy to digest sub modules.   You do have some ability to reorganize the material.  For instance simple functions are introduced very early and you could skip it, cover the material on assignments and structure to get to more complex code and then come back and introduce functions.\n\nHowever, in general it's difficult to reorganize any programming book since examples often depend on concepts and structures introduced in earlier modules.","organization_rating":3,"organization_review":"It's a matter of personal preference but I like to cover functions after structured programming.  It's fine to introduce the idea of calling a function if you use an example that requires a library function but the justification for functions doesn't come until the student has created more complicated code.  Otherwise the flow from data types and operators to selection statements and then to loop statements is fine and pretty standard for any C++ book.  File I/O isn't introduced until late, which might be an issue for some, but it's fine with me.","interface_rating":4,"interface_review":"The HTML works OK as far as the contents and modules.  Each section within the module is one to two pages (depending on your monitor resolution and zoom level).  There aren't many images and charts so there's no issues there.\n\nIt would be nice when I click on the module heading in the HTML version to take me to the start of the module instead of requiring me to expand it and click on a subsection.\n\nThe PDF version uses hard to read and old style fonts that look like old faded computer documentation.  The HTLM version is much more readable","grammatical_rating":5,"grammatical_review":"The grammar is fine.","cultural_rating":5,"cultural_review":"There are no cultural references in the book or even use of specific names.","overall_rating":9,"overall_review":"It's better than some of the other open or free textbooks I've seen out there and is potentially a good alternative to the $100 books.\n\nIf I was to adopt, I would skip over the early introduction to functions and skip the material on recursion and pointers (I think for community college students without calculus it's too much - calculus has nothing to do with pointers but it's the ability to deal with abstraction that's helpful).  I would add a more robust section on functions after the section on structured programming.   I would also add more many more examples and exercises.  Personally I would also add two dimensional arrays because they make a good visual usage case for nested loops.\n\nThe lab exercises are fine but I don't think there are enough of them.  But that's an easy thing to supplement.\n\nI'll use it as a resource in my classes but not make it the sole textbook.","created_at":"2017-06-21T00:00:00.000Z","updated_at":"2017-06-21T00:00:00.000Z"},{"id":1719,"first_name":"Winnie","last_name":"Rex","position":"Senior Lecturer","institution_name":"Bowling Green State University","comprehensiveness_rating":5,"comprehensiveness_review":"The text covers the typical content for an introductory programming course in C++ including decisions, loops, functions, arrays and file I/O.  It also has chapters that provide a brief explanation of pointers, object-oriented programming and high-performance computing. An appendix with information about the C++ language, a glossary and an index are also included.","accuracy_rating":5,"accuracy_review":"Textbook examples appear to be accurate and error-free in terms of the C++ language syntax and program format.","relevance_rating":3,"relevance_review":"The content is not up-to-date. Several new standards have been released for C++ (C++11, C++14) since the text was published.  However, the basic fundamental concepts covered in the text are still relevant.","clarity_rating":5,"clarity_review":"The text is written clearly and simply. Explanations of a concept are followed by a list of definitions for the same topic which are stated clearly.  The author's sometimes writes in the first-person (e.g., to tell a humorous story) and uses relatable analogies (e.g., the concept of a flag in programming is related to flags used in car races or flown from pirate ships).   He occasionally introduces color to highlight the relationship between coding lines and the output produced by these lines (p. 207-208).  This visual technique makes the connection easy to follow.","consistency_rating":5,"consistency_review":"The text is very consistent in the organization of the material in each chapter.  Every chapter has similar headings in the same order (e.g., General Discussion, Definitions, Demonstration Program, Exercises, etc.).  A consistent numbering format is used for sections and subsections in each chapter.\n","modularity_rating":4,"modularity_review":"The topics in the text are presented in a logical, clear fashion.  Topics are presented in the typical order for an introductory programming text.","organization_rating":4,"organization_review":"The topics in the text are presented in a logical, clear fashion.  Topics are presented in the typical order for an introductory programming text except that functions are introduced before decisions and loops.  Some may find this preferable while others will not.","interface_rating":5,"interface_review":"Navigation through the text was easy and all text components were clear and easy to read.","grammatical_rating":5,"grammatical_review":"The text is free of grammatical errors but there are occasional spelling errors and typos.","cultural_rating":4,"cultural_review":"The text is mostly free of any cultural references, although there was an occasional example that some might find off-putting or offensive (e.g., p. 177, if gender equals 'F', display \"Are you pregnant?\").  The text is culturally neutral and does not generally make use of examples that would indicate the race, ethnicity or background of a subject.","overall_rating":9,"overall_review":"The author notes that this text was not created to cover the language in detail (e.g., p. 165) but to concentrate on programming fundamentals and concepts and in that he has succeeded.  The book breaks down the introduction to programming topics into small manageable sections (e.g., with separate chapters for each format of the if statement and each type of loop).  However, more depth in the topics presented would be desirable for a college course for Computer Science majors.  Whatever the audience for the textbook, it would need to be supplemented with additional examples, exercises and lab and programming assignments.  The examples and assignments provided in the textbook are very basic.  Later examples do not include much integration of the programming constructs introduced earlier in the text.","created_at":"2018-02-02T00:00:00.000Z","updated_at":"2018-02-02T00:00:00.000Z"},{"id":1806,"first_name":"Jeffrey","last_name":"Chiampi","position":"Instructor of Computer Science and Mathematics","institution_name":"The Pennsylvania State Univeristy","comprehensiveness_rating":3,"comprehensiveness_review":"The book covers many of the topics I would expect to see in a book for an introductory programming course. It skips multidimensional arrays and structures. Although I wouldn't expect the book to cover the topic extensively it would be nice for it to mention classes. I feel that I would have to supplement this book with additional examples and chapters. C++ 11 and C++ 14 are not mentioned.","accuracy_rating":5,"accuracy_review":"The examples I reviewed appear to be accurate. I did not review every example. ","relevance_rating":5,"relevance_review":"C++ 11 and 14 are not covered. While these additions are not necessary to understand the basics of C++ it would be nice to see them mentioned. They could form their own chapter. Given the nature of C++ a new edition is not necessary on a fast basis. However, it would be nice to see future editions include more examples.","clarity_rating":4,"clarity_review":"The book is easy to follow and introduces terminology in an easy to follow fashion. I would like to see a list of terms after each chapter. ","consistency_rating":5,"consistency_review":"The book follows a consistent patterns. The material in each chapter is presented using the same pattern. Pseudocode, which is absent from some of the textbooks I review, is used throughout the chapters. It is an excellent way to introduce a new programming feature.","modularity_rating":3,"modularity_review":"I prefer to cover material in a different order than this textbook presents it. The examples tend to build off each other making it confusing to cover the material out of order. While this is not a problem unique to this book my current textbook is written in such a way that chapters can be re-ordered without encountering this problem. ","organization_rating":2,"organization_review":"I don't like the way some chapters are organized. If statements are split into chapters titled two way selection and multiway selection. Why not combine them into a chapter called \"decisions structures\", \"making decisions\", or just \"if statements\"? The average undergrad would understand what is in a chapter called \"if statements\" right away while multiway selection is confusing. ","interface_rating":4,"interface_review":"When viewed on my laptop, which has a rather small screen, some of the examples line wrap. This makes the code a little confusing to view.  I prefer the HTML edition to the PDF. Since this textbook is online it would be nice to see some interactive examples. ","grammatical_rating":5,"grammatical_review":"I found no grammar problems.","cultural_rating":5,"cultural_review":"The book is not culturally insensitive. This question is irrelevant for this type of book.","overall_rating":8,"overall_review":"This is a relatively good textbook. I would like to see a new edition with some of the major issues addressed. I would cover some of the material in a different order and supplement the material my University requires with chapters from other books. Given the current costs of programming books this textbook is a good value. ","created_at":"2018-02-02T00:00:00.000Z","updated_at":"2018-02-02T00:00:00.000Z"},{"id":1890,"first_name":"Andi","last_name":"Toce","position":"Associate Professor","institution_name":"CUNY LaGuardia Community College","comprehensiveness_rating":5,"comprehensiveness_review":"This book is designed for students taking an introductory programming course using the C++ programming language. It includes all the relevant topics for an introductory class. It also provides a lot of material to guide students to develop good programming habits which will be beneficial in any subsequent class and in the workplace.","accuracy_rating":5,"accuracy_review":"The content I was able to verify is accurate. The author pays close attention to every detail and is thorough in his explanations. ","relevance_rating":4,"relevance_review":"The book is 5 years old at the time of this writing. Computer Science and the programming are rapidly evolving so it very difficult to produce a document that is fully relevant for a long period of time. All content related to the basics of the programming and the discussion on the best habits and techniques of a successful programmer will remain relevant. The software tools such as Dev C++, used in this book, while may still be useful and sufficient are not as relevant. A large variety of new options is available to all programmers. The book however can still be used as is for a current introductory class. ","clarity_rating":4,"clarity_review":"The book is very well written. Each topic is discussed in detail. Relevant supporting material and background information is provided in prior to each new topic. The content is broken down into small units and the flow of content is logical and clear. ","consistency_rating":5,"consistency_review":"The book maintains the same 'feel' throughout. The style is consistent throat the book which makes it easier to follow. ","modularity_rating":3,"modularity_review":"The author does a good job at breaking down concepts into smaller units. As a consequence the initial table of contents clearly outlines the material and makes it easier for users to locate what they are looking for. In some cases some of the numbered subsections are very small. For example, a one line definition does not need to be in a separate section. I would also avoid a third level in the subsection hierarchy. For example section 6.5.1.6 can be combined in some way with all other subsections in 6.5.1. ","organization_rating":5,"organization_review":"The book is very well organized. It is evident that the author pays close attention to small detail. The flow of content is clear and all new material is preceded by sufficient relevant background information. ","interface_rating":3,"interface_review":"The visual feel of the book is very simplistic. The book can benefit from a visual makeover. Maybe some color, more figures, and a better presentation of code fragments.  ","grammatical_rating":5,"grammatical_review":"No issues identified.","cultural_rating":5,"cultural_review":"N/A","overall_rating":9,"overall_review":null,"created_at":"2018-02-02T00:00:00.000Z","updated_at":"2018-02-02T00:00:00.000Z"},{"id":33573,"first_name":"Gayathri","last_name":"Iyer","position":"Full time Faculty and Department Chair","institution_name":"Portland Community College","comprehensiveness_rating":5,"comprehensiveness_review":"The book is very comprehensive and covers everything needed for an Intro to Programming class. I love that it has Program Planning and Design as a topic. This is a very important concept we try to teach students at the beginning of this programming class. It would be great to see a quick Intro to Structs and some of the new C++ 11 syntax and examples.","accuracy_rating":5,"accuracy_review":"The content and examples I have looked at are accurate to the best of my knowledge.","relevance_rating":4,"relevance_review":"All content relevant to basics of programming and the language are still relevant. It has been a few years since the book has been written. It could be revised to include C++ 11 and C++ 14 syntax. It could also use some online interactive IDEs like replit, that would be more inclusive of students who use Chromebooks and such. A new book is not needed since a lot of the content is still very relevant - an update or revision to incorporate a few changes would be useful.","clarity_rating":5,"clarity_review":"The book is very clear and broken into small chunks for students to read and understand! I especially like the fact that it has pseudocode interspersed and definitions at the end of every chapter. Students who are just learning English are always appreciative of the definitions that help them understand the terms better.","consistency_rating":5,"consistency_review":"The book is very consistent throughout. It follows the same format and uses pseudocode and definitions for most if not all chapters.","modularity_rating":3,"modularity_review":"The book is definitely modularized well.  Some sections could be combined to form solid good sized sections. This format makes it seem like there are too many chapters especially when conditionals and loops are broken up into almost 3 chapters each. This can be overwhelming for students when they look at the long list of chapters. I would also rearrange the topics and sub topics better.","organization_rating":3,"organization_review":"If I were to use this book, I would have to rearrange some of the topics to make sure I put relevant topics in the beginning and move some chapters for later - like Program Control Functions. I would also combine some of the chapters like conditionals and loops and make it more comprehensive, so it is less intimidating for students. I would also make some topics towards the end as optional materials - like recursion and pointers - again I feel like this is too much to cover in one term for a community college!","interface_rating":3,"interface_review":"It would be great to have an interactive text book - where students can fill in some code and test them interactively. It would also benefit to have an app like Python tutor embedded that does code tracing so students can benefit from multiple ways to access the resources. This would also fit well into the Universal Design model that is preferred everywhere these days - especially with all institutions going remote due to COVID.","grammatical_rating":5,"grammatical_review":"I have not seen many or any grammatical errors so far.","cultural_rating":5,"cultural_review":"The book is not culturally insensitive or offensive in any way. I think the addition of definitions makes it inclusive.","overall_rating":9,"overall_review":"This is a good textbook. I would like to see a revised version with some of the major changes incorporated. It would also be good to have an interactive version and more examples and labs so students can get more practice. I would also incorporate more on functions and I would introduce that topic later in the book.\r\nOverall if I were to use this book, I would have to have specific notes to move chapters and sections around, and add supplemental examples and labs to give students more practice.","created_at":"2021-12-24T07:07:51.000Z","updated_at":"2021-12-24T07:07:51.000Z"},{"id":33813,"first_name":"Trisch","last_name":"Price","position":"Assistant Professor","institution_name":"Johnson County Community College","comprehensiveness_rating":5,"comprehensiveness_review":"Covers all necessary areas for a beginning C++ class.","accuracy_rating":5,"accuracy_review":"The technical accuracy is great. There are a few (very few) typos that I came across, but nothing that affects the material.","relevance_rating":5,"relevance_review":"This is a solid foundation for C++ programming. The basics of the language do not fluctuate much over time. The book is clearly laid out addressing one element at a time which would make it easy to update as releases of new language standards are rolled out.","clarity_rating":5,"clarity_review":"I really appreciate how easy this book is to read - I was able to get through the entire book in no time. I feel that it is very accessible to students who can get easily overwhelmed when reading technical books. Examples are often quite memorable. Little bits of humor are injected just often enough to keep you on your toes.","consistency_rating":5,"consistency_review":"Each chapter is laid out in the same manner. It is easy to envision how to use each element in a course.","modularity_rating":5,"modularity_review":"At 24 chapters and 300 pages, it seems like it might be too much. However, the chapters are very short and laden with good coding examples. I can see where I could easily assign two chapters per week because each chapter is fairly specific and steps through the language around the same pace that I cover the material in class.","organization_rating":5,"organization_review":"The book presents the language in clear steps starting with foundational knowledge and building from there.","interface_rating":4,"interface_review":"I read the book as a pdf so I was not able to use some of the links (is there a way to get an interactive pdf?). Other than that, no issues.","grammatical_rating":5,"grammatical_review":"none that I saw, just a few typos.","cultural_rating":5,"cultural_review":"This book in not insensitive or offensive in any way that I could see.","overall_rating":10,"overall_review":"I am planning to adopt this book for fall2022. There are many things that I like about it. It is easy to read. Examples are clear and often humorous (therefore, memorable - I will never cut up a can of soup). Program development and pseudocode are presented early on and stressed throughout. I find that more of my students struggle with the process than the syntax, this should help. The book has a logical progression starting with foundational language skills and building from there.","created_at":"2022-04-26T20:40:41.000Z","updated_at":"2022-04-26T20:40:41.000Z"},{"id":34250,"first_name":"Margaret","last_name":"Bleichman","position":"Professor","institution_name":"Middlesex Community College","comprehensiveness_rating":4,"comprehensiveness_review":"This textbook covers almost all the topics that a typical Programming I or Computing I course that uses the C++ programming language usually requires.  The approach it uses corresponds to a 'late objects' approach, which is what my college and the college that most of my students transfer to use. However, the way the topics are organized and ordered is a little confusing and unusual .See comments under organization.","accuracy_rating":5,"accuracy_review":"The book and its labs are accurate.  There are a few minor typos/spellos here and there, a few which make the code not compile. \r\nIn this textbook, all demo programs define variables used locally in main as global variables.  While this is not inaccurate, it is something that most people in industry avoid in well structured, maintainable code, and something I and most professors counsel students not to do.  So having every example do this here is a bit odd.","relevance_rating":4,"relevance_review":"The book is written in 2013 and many of the program examples are dated 2008/2009.  For the most part that isn't an issue.  However, newer versions of C++ have been in use since then, with a couple of constructs that are missing here.  In particular, C++ 11 introduced nullptr and range-based for loops.  My curriculum includes both of these.  The latter is particularly useful to teach students.  The book could easily be updated to add these.  An early section discussed IDE's and the book uses Dev-C++.  Other, more recent, IDE's might be more popular now, but Dev-C++ is free and simpler to use than some others, so it's actually helpful to have a section for this.  The source code in demo programs should work in any IDE a student chooses to use. \r\nPresent in every demo program is the author's custom pause function.  Most systems no longer need to call system pause to allow the user to view the output before the output window closes.  This is minor, but a professor will either have to explain the pause function, or tell the students to remove it from every example.  Also, it necessitates an explanation of functions at the beginning of the course, before the actual study of functions other than main is reached.","clarity_rating":4,"clarity_review":"The description of the concepts and constructs are pretty clear.  Adequate examples are used.  A plus in this book is the inclusion of a separate list of definitions for most chapters.  Because of the repetition of instructions to the student (i.e. to set up folders to contain their files.) there's a lot of extra text that has to be scrolled past.","consistency_rating":5,"consistency_review":"The textbook uses consistent format and terminology throughout.","modularity_rating":4,"modularity_review":"In an intro computer science course that would typically use this textbook, concepts are generally present in the same order in most textbooks. But, yes, if a professor wanted to skip a topic, this textbook allows for that.  However, the granularity of this textbook is too small.  For the topics I typically cover in this course (thru pointers), there are 22 chapters, as compared to 9 chapters in the textbook I currently use.  That actually makes it harder to find specific topics by looking at the table of contents.  Of course, searching in the online version can accomplish that.","organization_rating":3,"organization_review":"The section numbering of online version vs. pdf version, i.e. the numbering of chapters/modules, differs by 4.  i.e. Chapter 3 is in numbered section 7, etc.  It's confusing at first.  Students can get used to it, but it makes instructions awkward, i.e. to read Chapter 3, students have to read Sections numbered 7.1 to 7.8.\r\nChapter 10 introduces 2 forms of selection and 4 forms of repetition all at once.  It then covers them separately, but it's a lot for students to look at before understanding what selection or repetition is.\r\nSome concepts are introduced in the middle of chapters devoted to other concepts. This could be confusing to students. For example, File i/o is covered in the middle of the chapter introducing arrays. Most textbooks (and this professor) cover File i/o as its own topic, before or after arrays.","interface_rating":4,"interface_review":"The book comes in two versions:  online and a .pdf.  The online version is preferable to use, since students can click on links to download code and other sample files, etc.  Also, the table of contents is interactive.  The .pdf can be printed, but it uses a font that is hard on the eyes.  (The font used in the online version is much better.)  \r\nThe Memory Building Activities (MBA) links are dead in the online version.\r\nAlthough it's a plus to be able to download a source file to work with it, it should also be visible without having to download it.","grammatical_rating":5,"grammatical_review":"Although there are some typos/spellos, they are minor.","cultural_rating":1,"cultural_review":"This textbook is not inclusive, particularly with respect to gender.  Its use of gender pronouns is cause for concern. While many authors grapple with this, some choosing to alternate between male and female pronouns, or use generic pronouns, this author does not. Discussion and examples use generic nouns like friend, chef, programmer, user, systems analyst, painter, professor. However, all these use the pronouns he/him/his.  We've spent decades to expand the community of coders to beyond the traditional male students.  This textbook is unwelcoming to non-male students. In particular, to read that programmers, users, systems analysts, and students are male sets this textbook backwards in time many years.  Women (and non-binary) students are excluded and will not see themselves reflected here.  It is troubling that the only examples that use female pronouns are limited to mothers, a wife, and a Miss America contestant.  Really.  Literally, these are the only instances of non-male examples in the entire textbook, and they are at best a trope, at worst gender stereotypes.  Consider these alarming quotes:\r\n\"Saying that my cousin is the 2nd Runner Up in the Miss America contest sounds so much better than saying that she was in 3rd Place.\"  \r\n\"Calling you spouse \"Snooky\" may be meaningful to only you. Others might need to see her full name (Jane Mary Smith) to appropriately identify who you are talking about.\"\r\nIn this textbook, women can only be mothers, wives and beauty contestants, but never programmers or system analysts, or students. How depressing.","overall_rating":8,"overall_review":"I was hoping to use this textbook for my Programming I course.  It appeared to match my syllabus, particularly since it uses a 'late objects' approach and covers almost all the topics that my curriculum requires.  The text I currently use is Tony Gaddis' \"C++ From Control Structures through Objects\", which is great, but many students won't purchase a textbook, so I am looking for OER.  The organization of this text is a bit confusing and the embedding of some of the topics inside others is a bit odd.  That said, I was still ready to try it.  However, after spending 20 years implementing programs and activities to encourage students in groups which are underrepresented in STEM, particularly women and girls, I am troubled by the exclusion of women in this textbook except in a couple of stereotypic references.  This textbook sends a message that women need not apply to computer science careers.","created_at":"2022-12-08T04:23:44.000Z","updated_at":"2022-12-08T04:23:44.000Z"},{"id":35371,"first_name":"Dana","last_name":"Nelson","position":"Adjunct Faculty","institution_name":"Oregon Institute of Technology","comprehensiveness_rating":4,"comprehensiveness_review":"The materials reasonably cover introductory C++ topics.  They are suitable for a first term C++ class.  There is no index, however, there is a table of contents.  There is not a separate glossary, however, most sections contain a “Definitions” subtopic for new terminology introduced in that section.","accuracy_rating":4,"accuracy_review":"The content appears to be accurate error-free and unbiased.","relevance_rating":4,"relevance_review":"There have been multiple releases of the C++ standard since the release of the book.  Technology/tooling has changed/been updated/been invented.  However, as an introduction to C++, the focus/purpose of the book should be core C++ topics and language features, thought process, problem solving, etc.  These aspects are as valid now as when they were written.","clarity_rating":4,"clarity_review":"The prose is approachable.  Most sections have a “Definitions” subtopic where new terminology is defined.  Most sections also have an examples.","consistency_rating":4,"consistency_review":"The materials have internally consistent terminology.  They have a consistent format throughout.","modularity_rating":4,"modularity_review":"Larger topics are broken into relatively small chunks.  It seems like most of the smaller are \u003c= 5 pages.  These smaller chunks seem to generally have subheadings.  An instructor could easily assign one or more of these smaller chunks as an assigned reading multiple times a week.  Within the constraints of the language and logic these smaller chunks could be reorganized.","organization_rating":5,"organization_review":"The organization of topics is reasonable given the constraints of the language.  There is consistency in the structure/format of topics.","interface_rating":4,"interface_review":"In the PDF version. there are a number of “Link to: [missing_resource: index.html]”.  They appear to be links to external resources – perhaps exercises of some sort.  I don’t know if these were missing at the time of publication or if they became unavailable over time.","grammatical_rating":5,"grammatical_review":"I didn’t notice any grammatical issues.","cultural_rating":5,"cultural_review":"N/A","overall_rating":9,"overall_review":null,"created_at":"2024-12-23T16:37:22.000Z","updated_at":"2024-12-23T16:37:22.000Z"}],"url":"https://open.umn.edu/opentextbooks/textbooks/programming-fundamentals-a-modular-structured-approach-using-c","updated_at":"2024-12-23T16:37:22.000Z"},{"id":203,"title":"The Missing Link: An Introduction to Web Development and Programming","edition_statement":null,"volume":null,"copyright_year":2014,"ISBN10":null,"ISBN13":"9781502447968","license":"Attribution-NonCommercial-ShareAlike","language":"eng","description":"Web development is an evolving amalgamation of languages that work in concert to receive, modify, and deliver information between parties using the Internet as a mechanism of delivery. While it is easy to describe conceptually, implementation is accompanied by an overwhelming variety of languages, platforms, templates, frameworks, guidelines, and standards. Navigating a project from concept to completion often requires more than mastery of one or two complementing languages, meaning today's developers need both breadth, and depth, of knowledge to be effective. This text provides the developer with an understanding of the various elements of web development by focusing on the concepts and fundamentals through the examples within, providing a foundation that allows easier transition to other languages and a better understanding of how to approach their work. The reader will be introduced to topics in a manner that follows most project development methods, from initial conceptualization and design through front end development, back end development, and introducing additional concepts like accessibility and security, while focusing on responsive design techniques. Each section of the text includes opportunities to practice the material and assess increased knowledge after examining the topics.","contributors":[{"id":3844,"contribution":"Author","primary":true,"corporate":false,"title":null,"first_name":"Michael","middle_name":null,"last_name":"Mendez","location":null,"background_text":"Michael Mendez, M.S., is a professional web developer and professor with a master’s degree received after studying computer science, business, and communications at the State University of New York, University at Fredonia. Having worked in the information technology field for over 12 years, he has provided the small to medium business market and public sector agencies with services in hardware and network installation and support, web development, systems support and maintenance, and solutions design and implementation. These experiences have involved academic, media, emergency management, non-profit, business to business, and business to consumer organizations."}],"subjects":[{"id":3,"name":"Computer Science","parent_subject_id":null,"call_number":"QA76","visible_textbooks_count":137,"url":"https://open.umn.edu/opentextbooks/subjects/computer-science-information-systems"}],"publishers":[{"id":124,"name":"Open SUNY","url":"https://milneopentextbooks.org/","year":null,"created_at":"2018-09-07T17:22:37.000Z","updated_at":"2024-04-15T18:36:03.000Z"}],"formats":[{"id":177,"format":"PDF","url":"https://milneopentextbooks.org/download/the-missing-link-an-introduction-to-web-development-and-programming-pdf-3/?tmstv=1672320182","price":{"cents":0,"currency_iso":"USD"},"isbn":null},{"id":178,"format":"eBook","url":"https://milneopentextbooks.org/download/the-missing-link-an-introduction-to-web-development-and-programming-epub/?tmstv=1672320182","price":{"cents":0,"currency_iso":"USD"},"isbn":null},{"id":2121,"format":"Hardcopy","url":"http://www.amazon.com/The-Missing-Link-Introduction-Development/dp/1502447967/","price":{"cents":0,"currency_iso":"USD"},"isbn":null},{"id":2122,"format":"Online","url":"https://milnepublishing.geneseo.edu/themissinglink/","price":{"cents":0,"currency_iso":"USD"},"isbn":null}],"rating":"4","textbook_reviews_count":8,"reviews":[{"id":235,"first_name":"Martin","last_name":"Frické","position":"Professor","institution_name":"University of Arizona","comprehensiveness_rating":4,"comprehensiveness_review":"The book is reasonably comprehensive. It covers the html5 suite of html, css, and javascript, and augments that with PHP and MySQL for databases. Quite what should be in a book of this kind is a question with answers that drift into subjectivism and taste. This book has database normalization, which probably should not be there, and omits Content Management Systems (CMSs e.g. Drupal) and Drag-and-drop website builders such as Wix, Weebly, Square Space, etc. which should be there. It would also have been good to see some Integrated Development Environments (IDEs) for web development and programming (such as Eclipse, Netbeans, IntelliJ, JetBrains, etc.) and version control (such as GIT).\r\n\r\nThe book has a Glossary and an Index.\r\n","accuracy_rating":4,"accuracy_review":"The book is largely accurate. It is certainly accurate in its general assertions (but a single read detects half a dozen or so slips or mistake e.g. the z-index code on page 130). ","relevance_rating":4,"relevance_review":"The book is reasonably relevant. No book in this field will have much longevity.","clarity_rating":4,"clarity_review":"The clarity is very good, and the book is well written. Sometimes the author uses the first person when it is not really appropriate, for example, ‘I discourage the use of MD5, as its hashes are comparatively shorter than many others in use today’ (p.252) This would be better as ‘Experts discourage (or something similar)’","consistency_rating":4,"consistency_review":"The book is consistent.","modularity_rating":5,"modularity_review":"The book is modular.","organization_rating":4,"organization_review":"The structure and presentation are good.","interface_rating":5,"interface_review":"The interface is excellent.","grammatical_rating":3,"grammatical_review":"Some of the grammar is not the best. There a number of ‘sentences’ which are not sentences e.g. 'Never say never, but never give root.' (p.254) ","cultural_rating":4,"cultural_review":"There are no problems or issues of this kind.","overall_rating":8,"overall_review":"No.","created_at":"2015-06-11T00:00:00.000Z","updated_at":"2015-06-11T00:00:00.000Z"},{"id":310,"first_name":"Susan","last_name":"Pfeifer","position":"Associate Professor","institution_name":"Valley City State University","comprehensiveness_rating":4,"comprehensiveness_review":"The textbook is very comprehensive and covers all aspects of web development including possible technologies needed to make it work. High level content is provided in all areas with recommended resources available to those who want to learn more detail about each topic.","accuracy_rating":4,"accuracy_review":"The textbook seems accurate and provides information regarding a variety of technologies.","relevance_rating":4,"relevance_review":"The historical and generic chapters are grouped together separately from the technology specific chapters. This would allow updates to the technical chapters without impacting the entire book.","clarity_rating":4,"clarity_review":"The textbook is written in a very laid-back manner but gets to the point of what is needed. Terminology is defined.","consistency_rating":4,"consistency_review":"The text is consistent in the amount of information and level of detail provided through the book.","modularity_rating":4,"modularity_review":"Professors could easily use this textbook in a modular fashion by pulling chapters as needed to fit the context of the course.","organization_rating":4,"organization_review":"This would be a difficult book to read from front to back. However, in the context of an academic course, it provides great flexibility to the professor to structure a course in a manner that teaches the appropriate concepts to students, and uses this textbook as reference material or supporting reading. It can be used as reference similarly to online resources and provides students with one place to look for this content.","interface_rating":4,"interface_review":"The PDF version was very portable to various devices and allowed note taking and review of comments.","grammatical_rating":4,"grammatical_review":"There were no significant grammatical errors noted.","cultural_rating":4,"cultural_review":"The book focuses greatly on technology leaving little room for insensitive interpretations. The database examples use artist and musical industry examples with a fairly diverse variety in musical selections. If anything, the musical selections are older and may be less engaging to current undergrads.","overall_rating":8,"overall_review":"I would use this textbook as a reference book while teaching students concepts in web development. This would allow me to structure my course in a way that makes sense for my students and still provides some content to support the learning in the context needed. I like the flexibility this book provides to professors to use what is needed. There are also questions and examples that may be useful. I could also see this textbook used for students with advanced web development knowledge to complete a final project or capstone experience course.","created_at":"2016-01-08T00:00:00.000Z","updated_at":"2016-01-08T00:00:00.000Z"},{"id":472,"first_name":"Chi-Cheng","last_name":"Lin","position":"Professor","institution_name":"Winona State University","comprehensiveness_rating":4,"comprehensiveness_review":"The book is very comprehensive.  It covers all the key functional components in the modern multi-tier Web architecture that includes HTML+CSS, client-side scripting, server-side scripting, and data storage.  It also discusses other important aspects, including accessibility such as visually impaired considerations, security, and design process.  The resources provided in LEARN MORE boxes are useful for readers to study more about topics of interest on their own.  Also, the book does have an effective index.\n\nThere are a few issues associated with Glossary of Terms:\n1. The terms in “Glossary of Terms” should be listed in the alphabetical order.  \n2. The Glossary of Terms should be expanded to at least include essential terms such as HTTP, IP, TCP, and URL.  \n3. UDP is defined as “User Datagram Protocol. Similar communication method to HTTP, but differs in ...”  UDP is a transport layer protocol and should not be compared to HTTP, an application layer protocol.   TCP should be used in place of HTTP in the definition.","accuracy_rating":4,"accuracy_review":"The book is quite accurate.  Some technical inaccuracies, however, do exist as described below.\n1. On Page 3, “Transfer Control Protocol/Internetwork Protocol (TCP/IP)” should be “Transmission Control Protocol/Internet Protocol (TCP/IP)”.\n2. On Page 21: “each piece of the message, or payload, is wrapped in a header” Payload is not wrapped in a header.  A payload is wrapped (or encapsulated) inside a packet together with a header.\n3. On page 62, “In the beginning, back to the first days of the Internet and ARPA, the primary purpose of creating a page was to share research and information. HTML tags were only meant to provide layout and formatting of a page.” should be “In the beginning, back to the first days of the World Wide Web, the primary purpose …”  The Internet and ARPANET started in 1969 way before HTML was born in 1993 for the Web.  The Internet is not the Web, and vice versa.\n4. On Page 108: “, , ” should be “, , ”.  The  tag is not a tag to avoid.","relevance_rating":4,"relevance_review":"It is challenging for a book of this topic to stay current for a long time.  The book nonetheless is organized in a way that its content could evolve with the technology effectively.","clarity_rating":5,"clarity_review":"The book is written in a very clear fashion and is not difficult to follow.  Terminology used are explained well at large.","consistency_rating":4,"consistency_review":"The book is consistent in general.  The only significant inconsistency is that \"Learning Objectives\" is used in the first three Sections while \"Learning Goals\" is used in the last two Sections.","modularity_rating":5,"modularity_review":"The book meets this criterion without a doubt.","organization_rating":5,"organization_review":"The organization, structure, and flow of the book are all good.","interface_rating":5,"interface_review":"The interface of the book is very good.  Links in the PDF file link to internal parts of the book and external resources.  However, on Page 92's Post section, a link after “see” as in “The data is sent in the headers (see) …” seems missing.","grammatical_rating":4,"grammatical_review":"There are no significant grammatical errors.  It does have some acronym issues and typographical errors.  \n1. Several acronyms are spelled out only after they are introduced for the first time.  UDP is only spelled out in Glossary of Terms.\n2. On Page 3, 10 to the 15th power is described as “(10 with 15 zeroes after it)” and it should be “(1 with 15 zeroes after it)”.\n3. On Page 21, “These new addresses might look like 2001:0db8:85a3:0042:1000:8a2e:0370:7334, and can support roughly 4 billion unique addresses.”  4 billion is the number of unique addresses supported by IPv4 as stated earlier on the same page.  The number of addresses supported by IPv6 should be 2 to the 128th power, roughly 3.4 x 10 to the 38th power.","cultural_rating":4,"cultural_review":"The discussions of historical aspects and security are cultural relevant.  Using music and artists in the database example is also a good idea in this aspect.","overall_rating":9,"overall_review":"The book does a good job at adopting the full stack approach and emphasizing on the best practice.  Also, listing learning objectives at the beginning of each Section is commendable.","created_at":"2016-08-22T00:00:00.000Z","updated_at":"2016-08-22T00:00:00.000Z"},{"id":1118,"first_name":"Devan","last_name":"Shepherd","position":"Instructor","institution_name":"Saint Paul College","comprehensiveness_rating":5,"comprehensiveness_review":"This book introduces a very broad set of essential Web development technologies in a theoretical, reference-based, style. In fact, this is one of its significant strengths. From a foundation suite of HTML5, CSS 3, and JavaScript 6 client-side technologies, through server-side PHP scripting and MySQL databases, the book discusses a bit of everything required to create Web solutions. There were times when I wished that the author had chosen to go into more depth on topics, but that was not the intent of this book, from what I can determine.","accuracy_rating":5,"accuracy_review":"I did not find any inaccuracies.","relevance_rating":5,"relevance_review":"No book on any computer technology lasts forever, but we should not expect that. Computer technologies are constantly changing / evolving / morphing. This book lays an excellent theoretical foundation for Web Development that can transcend the specific languages, tools, frameworks, and approaches discussed in support of a multi-tier architecture of the Web.","clarity_rating":4,"clarity_review":"The book is clear, concise, and maintains a good cadence throughout. It is supported by a brief glossary, that I would have preferred to have been much more comprehensive, however, the majority of terms, abbreviations, and acronyms are introduced sufficiently in the body of the text.","consistency_rating":5,"consistency_review":"The book is very well-written, and the voice, cadence, presentation style, and approach are consistent throughout.","modularity_rating":5,"modularity_review":"The book is very \"modular,\" and the table of contents serves as an excellent map to the demarcation between major sections. Since the book needs to touch such a broad spectrum of technologies, modularity is essential. However, the author does an excellent job of ensuring that the reader is not abandoned anywhere - the modules are nicely integrated and threaded together, one with another.","organization_rating":5,"organization_review":"The book is organized around the components of Web solutions, touching on client-side and server-side technologies. Five major sections are entitled: \"Web Development,\" \"Document Markup,\" \"Scripting languages,\" \"Persistent Data Storage,\" and \"Tying it Together.\" Chapters in each section develop the topics with code snippets and practical examples. Links at the end of some chapters provide additional references, resources, and occasionally links to online tutorials. The author explains that this book purposefully integrates broad technologies - and I feel that he has done so very well. To be successful, a Web developer needs to know more than only HTML, or JavaScript, she or he must master a lot of technologies and be able to weave them into a solution. This book provides a blueprint for that integration.","interface_rating":5,"interface_review":"I did not find any interface issues that might distract or confuse a reader.","grammatical_rating":5,"grammatical_review":"The text contains no grammatical errors that I noticed.","cultural_rating":5,"cultural_review":"The text is not culturally insensitive or offensive.","overall_rating":10,"overall_review":"I anticipate adding this book as a resource in several Web Development, Web Design, Client-Side Programming, Server-Side Programming, and MIS classes. Without any reservation, I recommend this book to those seeking a resource that provides a thoughtful and complete overview of the essential components in Web development.","created_at":"2017-04-12T00:00:00.000Z","updated_at":"2017-04-12T00:00:00.000Z"},{"id":1435,"first_name":"Hakam","last_name":"Alomari","position":"Assistant Professor","institution_name":"Miami University","comprehensiveness_rating":2,"comprehensiveness_review":"This textbook is not appropriate for the computer science and/or the software engineering students. I believe this textbook is not a specialist one, the reader can consider it as an overview or for general reading.","accuracy_rating":4,"accuracy_review":"The accuracy level is acceptable, some minor issues here and there, and this is the acceptable again.","relevance_rating":4,"relevance_review":"This textbook is published in 2014. It is supposed to be up-to-date till that time, however, some related topics at that time is still missing.","clarity_rating":3,"clarity_review":"There is no enough programming examples provided for the reader. I can not use this textbook to help me/students to learn web development and programming.","consistency_rating":2,"consistency_review":"Yes it is consistence using the same concepts with exactly the meaning every time, however, the connection between the title of this book and its content is violated. For example, this textbook is not about web development it is about how to connect and integrates multiple web programming languages together to accomplish creating a web page.","modularity_rating":3,"modularity_review":"The book contains 46 small chapters! yes it is consistence using the same framework, however it is tedious having all this chapters to cover strongly related materials","organization_rating":3,"organization_review":"The topics are logical, however again 46 chapters to cover almost the same concepts is too much. I suggest reorganize the text in a way that cover several modules and how these modules connected together.","interface_rating":4,"interface_review":"N/A","grammatical_rating":4,"grammatical_review":"Minor issues","cultural_rating":3,"cultural_review":"The examples used are very simple, and this is not enough for the learning purpose. No challenging questions, the idea is explained always these naive examples, which I believe not enough.","overall_rating":6,"overall_review":"N/A","created_at":"2017-06-21T00:00:00.000Z","updated_at":"2017-06-21T00:00:00.000Z"},{"id":1471,"first_name":"Jonathan","last_name":"Hiatt","position":"Instructor","institution_name":"Chemeketa Community College","comprehensiveness_rating":5,"comprehensiveness_review":"The text is very comprehensive at a high level.  There could be more detail to some of the topics.  The index is effective.  The glossary could either be eliminated and added to the index or it needs to be expanded as there are some terms that should probably be included.","accuracy_rating":5,"accuracy_review":"The book is very accurate and I did not catch any errors.  The sample code and side notes are very informative and useful.  I know this content focuses on free technology but it does not even mention Microsoft or other similar manufactures thus leaving out a large and significant segment of technology.  I am not sure if this would be considered a bias but I believe does students new to web development a disservice.","relevance_rating":5,"relevance_review":"The content is very relevant but as with most any technology book the lifespan of the content will be short lived.  The text was written and arranged in such a way that it should be relatively easy to update.","clarity_rating":5,"clarity_review":"The book is clear and written at a level that a beginning web developer should be able to easily understand.  The technical terminology is clearly explained and usually demonstrated in samples.","consistency_rating":5,"consistency_review":"The book is consistent and fluid.","modularity_rating":5,"modularity_review":"The book's modularity is sufficient but it may not be easily reorganized due to the nature of the topic.  I would be hard to put some topics ahead of others due to order in which it must be learned.","organization_rating":5,"organization_review":"The text is organized well and the flow is logical.","interface_rating":5,"interface_review":"The interface is appropriate and does not present any distractions or confusions.","grammatical_rating":5,"grammatical_review":"The text does not appear to have any grammatical errors.","cultural_rating":5,"cultural_review":"The text is not culturally insensitive.","overall_rating":10,"overall_review":null,"created_at":"2017-06-21T00:00:00.000Z","updated_at":"2017-06-21T00:00:00.000Z"},{"id":1694,"first_name":"Jerry","last_name":"Schnepp","position":"Assistant Professor","institution_name":"Bowling Green State University","comprehensiveness_rating":3,"comprehensiveness_review":"Overall, this book serves as a broad introduction to web development. This approach is particularly valuable because it is a single resource that tells the whole story without going into too much depth. When students are ready to dive deeper into specific topics, they should use other resources.","accuracy_rating":5,"accuracy_review":"Very accurate.","relevance_rating":2,"relevance_review":"Content is not completely up to date - which is a tall order for web technology. I'm not sure that this sort of textbook can stay up to date. it is nearly impossible to include all the relevant technologies. The best I think it can do is to summarize the most used/relevant technologies while recognizing those on the horizon.","clarity_rating":5,"clarity_review":"Very clear","consistency_rating":5,"consistency_review":"It's very consistent. Each section uses a similar format.","modularity_rating":5,"modularity_review":"The first section presents a great overview for students interested in becoming professional developers, as it explains the most common paradigms (architecture, development, roles, etc).\n\nThe second section explains the most commonly used document tags and CSS styles. This is the type of information students typically learn from an HTML/CSS reference book. \n\nSection three provides an overview of scripting languages and their uses. Since these technologies are used in very diverse contexts, this section is particularly shallow - out of necessity. As with previous concepts, students should use this section to learn about the capabilities of these technologies and seek more complex examples in online repositories or in other texts.\n\nThe fourth section focuses on databases and supporting database technology. It begins with an overview of the access mechanisms and proceeds to cover basic relational database theory.\n\nSection five concludes the book with by exploring security concerns and optimization.","organization_rating":5,"organization_review":"The organization is good. It seems appropriate for a student who is new to web development.","interface_rating":5,"interface_review":"The interface is good.","grammatical_rating":5,"grammatical_review":"I did not find any grammar mistakes.","cultural_rating":1,"cultural_review":"This is a highly technical book that does not address cultural issues.","overall_rating":8,"overall_review":"Overall, this book serves as a broad introduction to web development. This approach is particularly valuable because it is a single resource that tells the whole story without going into too much depth. When students are ready to dive deeper into specific topics, they should use other resources.\n\nThe first section presents a great overview for students interested in becoming professional developers, as it explains the most common paradigms (architecture, development, roles, etc).\n\nThe second section explains the most commonly used document tags and CSS styles. This is the type of information students typically learn from an HTML/CSS reference book. \n\nSection three provides an overview of scripting languages and their uses. Since these technologies are used in very diverse contexts, this section is particularly shallow - out of necessity. As with previous concepts, students should use this section to learn about the capabilities of these technologies and seek more complex examples in online repositories or in other texts.\n\nThe fourth section focuses on databases and supporting database technology. It begins with an overview of the access mechanisms and proceeds to cover basic relational database theory.\n\nSection five concludes the book with by exploring security concerns and optimization.","created_at":"2018-02-02T00:00:00.000Z","updated_at":"2018-02-02T00:00:00.000Z"},{"id":4658,"first_name":"Subhasish","last_name":"Dasgupta","position":"Associate Professor of Information Systems","institution_name":"The George Washington University","comprehensiveness_rating":4,"comprehensiveness_review":"The book is a comprehensive one. It covers all aspects of web development from basic HTML to PHP scripting and MySQL databases.","accuracy_rating":2,"accuracy_review":"This is where I have the most concerns. The book is outdated. It refers to older versions of HTML and PHP, which are no longer in use. For example, the books still presents functions such as mysql_connect() have been deprecated. The new function is mysqli_connect(). Some of the code in the text will not work any more. The code needs to be updated.","relevance_rating":2,"relevance_review":"Relevance is limited because the book refers to earlier versions of PHP code. Some sections of the book cannot be used any more.","clarity_rating":5,"clarity_review":"The presentation of the material in the book is very clear. It is comprehensive and ideas are presented well. In terms of clarity it is a great book.","consistency_rating":5,"consistency_review":"The framework and terminology are consistent.","modularity_rating":5,"modularity_review":"The book is divided into different modules for web development, document mark up, scripting languages, persistent data storage, and an integrative section at the end. The modules are well though out and well presented. Each module or section presents in-depth information.","organization_rating":4,"organization_review":"The book is structured well. It reviews the basics of networking, servers, and HTML and then moves to scripting languages. It is organized very well. It would an ideal book for one of the courses I teach if some of the issues mentioned above could be addressed.","interface_rating":5,"interface_review":"The book's interface is good, I didn't see any problems at all.","grammatical_rating":5,"grammatical_review":"Grammatically, the book is well written.1","cultural_rating":5,"cultural_review":"I don't think this question is relevant to the book.","overall_rating":8,"overall_review":"This would have been an excellent book if it had been revised for newer versions of the software. As mentioned earlier some of the functions have been deprecated (not used anymore). The text needs to be updated because some of the code does not work. If some of the corrections are made this would be a perfect book for the Cloud Applications course I teach.","created_at":"2021-02-27T04:42:45.000Z","updated_at":"2021-02-27T04:42:45.000Z"}],"url":"https://open.umn.edu/opentextbooks/textbooks/the-missing-link-an-introduction-to-web-development-and-programming","updated_at":"2024-08-19T13:22:49.000Z"},{"id":419,"title":"Introduction to Programming Using Java","edition_statement":"Eighth Edition","volume":null,"copyright_year":2015,"ISBN10":null,"ISBN13":null,"license":"Attribution-NonCommercial-ShareAlike","language":"eng","description":"Welcome to the Eighth Edition of Introduction to Programming Using Java, a free, on-line textbook on introductory programming, which uses Java as the language of instruction. This book is directed mainly towards beginning programmers, although it might also be useful for experienced programmers who want to learn something about Java. It is not meant to provide complete coverage of the Java language. The eighth edition requires Java 8 or later, and it uses JavaFX for GUI programming. Version 8.1 is a small update of Version 8.0. This version briefly covers some of the new features in Java 11 and makes it clearer how to use this book with Java 11 and later.","contributors":[{"id":4056,"contribution":"Author","primary":true,"corporate":false,"title":null,"first_name":"David","middle_name":"J.","last_name":"Eck","location":"Hobart and William Smith Colleges","background_text":"David J. Eck Ph.D. is a Professor at Department of Mathematics and Computer Science at the Hobart and William Smith Colleges."}],"subjects":[{"id":3,"name":"Computer Science","parent_subject_id":null,"call_number":"QA76","visible_textbooks_count":137,"url":"https://open.umn.edu/opentextbooks/subjects/computer-science-information-systems"},{"id":59,"name":"Programming Languages","parent_subject_id":3,"call_number":"QA76","visible_textbooks_count":26,"url":"https://open.umn.edu/opentextbooks/subjects/programming-languages"}],"publishers":[{"id":317,"name":"David J. Eck","url":"http://math.hws.edu/javanotes/","year":null,"created_at":"2018-09-07T17:22:38.000Z","updated_at":"2020-01-03T04:30:43.000Z"}],"formats":[{"id":503,"format":"PDF","url":"http://math.hws.edu/javanotes/#:~:text=Downloading%20And%20Other%20Links","price":{"cents":0,"currency_iso":"USD"},"isbn":null},{"id":505,"format":"eBook","url":"http://math.hws.edu/javanotes/#:~:text=Downloading%20And%20Other%20Links","price":{"cents":0,"currency_iso":"USD"},"isbn":null},{"id":506,"format":"Online","url":"http://math.hws.edu/javanotes/#:~:text=Downloading%20And%20Other%20Links","price":{"cents":0,"currency_iso":"USD"},"isbn":null},{"id":1262,"format":"Hardcopy","url":"http://www.lulu.com/shop/david-eck/introduction-to-programming-using-java/paperback/product-24154166.html","price":{"cents":0,"currency_iso":"USD"},"isbn":null}],"rating":"4.5","textbook_reviews_count":6,"reviews":[{"id":1362,"first_name":"Ian","last_name":"Finlayson","position":"Assistant Professor","institution_name":"The University of Mary Washington","comprehensiveness_rating":5,"comprehensiveness_review":"This textbook is remarkably comprehensive.  It covers a tremendous amount of material, including nearly every facet of the Java programming language (such as anonymous inner classes, lambdas, variable arity methods etc.).  It also includes a chapter covering basic data structures such as lists, stacks, queues and binary trees, as well as chapters on multi-threading and networking, in addition to its thorough and integrated coverage of graphical user interfaces.  When using this text for a one semester CS 1 course, I use roughly half of the content.  I would probably not use it for a non-major's CS 0 course, as it could be an overwhelming amount of material for students.\n\nThe book is excellent for self-study - many students love having all the extra material available even if we don't cover it in class.\n\nOne area where I would have like to have seen more content is in the books coverage of recursion.  There is one section in chapter nine dealing with recursion which contains four examples.  Recursion is also used for implementing lists and trees, but it would be nice to have a slightly longer treatment as it is a confusing topic for many beginning students.\n\nThe text does not include an index.  The book itself also does not contain a glossary, but there is one on the companion web site.  The text includes quizzes at the end of each chapter, as well as programming exercises.","accuracy_rating":5,"accuracy_review":"I did not notice any technical errors or inaccuracies in the book.","relevance_rating":4,"relevance_review":"The book mostly covers Java 7, with some treatment of Java 8 features, so as of now, the book is perfectly up to date.  Future changes to Java likely won't necessitate major changes to the text, and the author has updated the text several times (currently on version 7).\n\nThe one area of slight concern is with the Swing library used to build GUI applications.  Oracle has replaced Swing with JavaFX, which is the new preferred way of writing GUIs in Java.  Still, Swing is widely used and a fine thing to use for introductory courses.  Moreover, Swing will be a supported part of Java for a long time as it is still so widely used.","clarity_rating":5,"clarity_review":"I think the clarity of writing is the best feature of this text.  The author uses an easy to read, conversational writing style.  The text is also very thorough in its explanations.","consistency_rating":5,"consistency_review":"The author does a good job using consistent terminology.  He explains new terms which are introduced and is very careful about phrasing in general.  For instance when talking about objects he has this to say:\n\n\"It is certainly not at all true to say that the object is 'stored in the variable std.' The proper terminology is that 'the variable std refers to or points to the object\".\n\nActually speaking about the terminology explicitly like this is really helpful.\n\nThe text does use the term \"subroutine\".  While it is internally consistent about this, it is not really consistent with other sources which nearly always refer to them as \"methods\" in the context of Java.  It is not a big point, but students may be confused because they are not called subroutines in other resources they may consult.","modularity_rating":4,"modularity_review":"The text is as modular as any other introductory programming text book I have seen.  It wouldn't be possible to make sense of the example programs in later chapters without a solid mastery of the material in earlier chapters, but that's expected with this type of text.  That said, the book does a good job of being as modular as it can.  For instance, several of the later sections in a chapter can be skipped over, and, as I describe below, I re-arrange the material slightly to fit my course.\n\nOne caveat to this is that many of the examples in later chapters make use of the GUI programming from chapter six.  When considering this text, you should be aware that its use of graphics is pretty fundamental and not something you could easily skip over.  I see this as a positive as it adds some interest to the example programs which are graphical.","organization_rating":5,"organization_review":"I like the organization of the book quite a lot.  It does not use the \"objects first\" approach.  Objects and classes are covered in chapter five, after the basic programming building blocks such as control structures and methods.  I did find that some of the later sections within a chapter were things I didn't want to introduce to students at that point.  For instance I skip the section on exceptions at the end of chapter three, and the sections on interfaces and nested classes at the end of chapter five.\n\nI do think that the putting off arrays until chapter seven is a mistake, mostly because it is just hard to give good assignments that don't use arrays.  When teaching with this book, I cover chapter seven after chapter four.\n\nOverall though, the book does a fine job of transitioning from one topic to the next as it covers not only the particulars of the Java programming language, but the art of programming itself.","interface_rating":5,"interface_review":"I did not find any interface issues at all.  The text includes helpful PDF links in the table of contents, and also when the text makes a reference to another section.  When discussing the example programs, the author also includes links to the full code on the book's web site, which is helpful.  Figures are easy to read and high resolution.  One suggestion I would have to improve the interface would be to include syntax highlighting for code listings.","grammatical_rating":5,"grammatical_review":"The text is remarkably well edited for its length.  I only noticed a handful of spelling or grammatical errors in the book.","cultural_rating":5,"cultural_review":"I didn't notice any instances of the text being culturally insensitive.  The text did not refer to people very often at all.  In the few times it mentions the user or programmer, the author uses male and female pronouns equally.  For instance at one point the text will mention a guess the number program telling the user \"he lost\", and later on saying a blackjack program should quit when the user wants to or when \"she runs out of money\".","overall_rating":10,"overall_review":"I think this book is superior to other introductory programming texts that I have used, even without considering the fact that it is open and free.  It is very detailed and provides clear expositions and great examples on everything that can be included in an introductory course (and then some).  The few criticisms I have for the book can be easily worked around.","created_at":"2017-06-21T00:00:00.000Z","updated_at":"2017-06-21T00:00:00.000Z"},{"id":1970,"first_name":"John","last_name":"McManus","position":"Assistant Professor","institution_name":"Randolph-Macon College","comprehensiveness_rating":5,"comprehensiveness_review":"This textbook is comprehensive. It covers a significant amount of material in a well-thought out and logical manner. The text starts with basic programming concepts introducing variables, types and input and output.  The author covers the basics of a variety of programming environments including Eclipse, NetBeans, and the command line environment. The next section introduces control structures, exception handling, and introduces arrays and GUI programming. The early introduction of arrays and GUI program is a nice feature, allow students to add address slightly more complex problems.  The book introduces objects and classes late, allowing introductory students to focus on syntax and basic problem solving before adding objects.  I believe the text is well suited to a two-semester introductory sequence, or an upper level Software Design Course.  The text includes quizzes at the end of each chapter, as well as programming exercises.","accuracy_rating":5,"accuracy_review":"I did not see any technical errors or inaccuracies in the book.","relevance_rating":4,"relevance_review":"The book uses the Swing library used to build GUI applications. Swing has been replaced with JavaFX. Swing is still widely used and okay for an introductory courses; the text should be updated to cover JavaFX.","clarity_rating":5,"clarity_review":"The author uses an easy to read, conversational writing style and provides very thorough explanations.  The flow is very logical, with sections building on the prior section.","consistency_rating":5,"consistency_review":"The author uses consistent, and for the most part, modern terminology.  The use of “subroutine” can be a confusing to students.  The more correct term “methods” is also used and it’s not clear why “subroutines” is introduced.  I appreciate the use of JavaDoc.","modularity_rating":5,"modularity_review":"The text is as modular, and the order that the modules are introduced in is very logical.  It is possible to re-order the modules to match your preferences for introducing specific topics.","organization_rating":4,"organization_review":"I like the organization of the book for an introductory course, and for a course on software design. approach. Objects and classes are covered in chapter five, after the basic programming building blocks such as control structures and methods have been covered.  This allows you to choose the depth that you cover topics, going slower in an introductory class, but faster in a course on  Software design. I would recommend moving some sections around.  I like to introduce arrays early, and I defer exceptions until a bit later.","interface_rating":5,"interface_review":"I did not find any interface issues. The text includes PDF links in the table of contents, and also when the text makes a reference to another section. The author also includes links to the full code examples on the book's web site. Figures are easy to read and high resolution.","grammatical_rating":5,"grammatical_review":"The text is well edited. I found a very small number of spelling or grammatical errors in the book.  The book is “cleaner” that many professional edited textbooks.","cultural_rating":5,"cultural_review":"I didn't notice any instances of the text being culturally insensitive. It is difficult to always find neutral examples or references.  The sample problems are appropriate.","overall_rating":10,"overall_review":"This is one of the best Java programming texts that I have reviewed.  I am currently using a different text and plan to switch to this text next semester.  It is very detailed.  The author provides explanations of the core concepts and provides great examples.  The modular approach allows it to be used in an introductory CS class, with Java as a first language; and in a software design class focusing on object-oriented design.","created_at":"2018-03-28T00:00:00.000Z","updated_at":"2018-03-28T00:00:00.000Z"},{"id":3429,"first_name":"Joey","last_name":"Cho","position":"Professor","institution_name":"Colorado State University - Pueblo","comprehensiveness_rating":5,"comprehensiveness_review":"The book covers all important and necessary topics for beginners in 13 chapters.","accuracy_rating":5,"accuracy_review":"The content is very accurate but here's minor things:\r\n1. On page 14, the word \"but\" was typed twice (...but but has recently been removed...)\r\n2. In section 10.1.4, the abbreviation for Java Collection Framework should be JCF not JFC.","relevance_rating":5,"relevance_review":"Content is very fresh with a full of good examples and exercises. The previous version describes Swing libraries for the graphical user interface but the current version describes the up-to-date JavaFX.","clarity_rating":5,"clarity_review":"The text was written with very easy words and explains concepts clearly with appropriate examples and pictures.","consistency_rating":5,"consistency_review":"The text has a very good flow with a consistent jargon and framework. For example, in section 3.8, the concept of Arrays is introduced and explained later in detail in chapter 7. Also, the GUI programming is introduced in section 3.9 as an appetizer and described fully in chapter 6 and 13 with consistency.","modularity_rating":5,"modularity_review":"The text is consisted of 13 chapters and many sub sections to facilitate any instructor/user to reconstruct/reorganize the content without any difficulties.","organization_rating":5,"organization_review":"The essential topics of Java programming are organized in a way for beginners to read and study easily.","interface_rating":5,"interface_review":"Any interface issues are found. The PDF file that can be downloaded from the open book site provides bookmark links to specific topics of interest, and the table of contents are hyperlinked. Also, all of the name of example code listed in the text have a link to actual code.","grammatical_rating":5,"grammatical_review":"No grammatical errors are found.","cultural_rating":5,"cultural_review":"The text is full of good examples and exercises without having any bias culturally and ethnically.","overall_rating":10,"overall_review":"The introduction to the Conway’s Game of Life and the Checkers in chapter 7, and the Towers of Hanoi and the Blob Counting in chapter 8 are very useful examples for students who are interested in game programming. Also, 3 network programming examples (a simple chat room, a networked Tic-tac-toe game, and a networked Poker game) in section 12.5 could attract a lot of student's attention.\r\n\r\nIn section 6.1.3, when a BorderPane is explained, it would be good to show a picture of a BorderPane of the 5 section as shown in section 6.5.2 or place a link to that section.","created_at":"2019-12-24T15:56:49.000Z","updated_at":"2019-12-24T15:56:49.000Z"},{"id":4785,"first_name":"Eric","last_name":"Jiang","position":"Professor","institution_name":"University of San Diego","comprehensiveness_rating":5,"comprehensiveness_review":"This book is quite comprehensive and it provides all foundational topics for beginners to learn the Java programming language. In addition, it offers a nice overview of Java programming environments and includes chapters on graphical user interfaces and programming with multi-threading. The book is suitable for a typical first programming course in Java and some of the book’s material can also be used for a subsequent programming course.","accuracy_rating":5,"accuracy_review":"I did not find any technical errors or inaccuracies in the book.","relevance_rating":5,"relevance_review":"The current 8th edition of the book is based on Java 8 and it uses JavaFX for GUI programming, so the book’s content is quite up-to-date. Of course, as more features are periodically added to the Java language, the book will need to be revised accordingly.","clarity_rating":5,"clarity_review":"The book is extremely well-written and easy to follow. In fact, the author uses a conversational writing style and provides clear explanations of concepts and principles throughout the book. All of these make it a good text book for beginners.","consistency_rating":5,"consistency_review":"The author uses consistent terminology internally. But the term “subroutine” introduced in the book would not be consistent with other Java sources including Oracle’s Java Documentation where the term “method” is used. This external term inconsistency may cause some confusions to readers.","modularity_rating":4,"modularity_review":"The book is generally modular. One could cluster and rearrange some of its chapters or sections to fit an intro to Java class. However, the book’s modularity could be further enhanced by re-organizing its coverage of some topics. For instance, it would be good to separate the section on recursion from linked data structures and to consider expanding it to a chapter because the recursion concept and recursive algorithms are usually difficult to comprehend for many beginners.","organization_rating":4,"organization_review":"The author does a good job presenting the material in a logical manner. The book starts basic language constructs and then covers methods, program design, classes, arrays and some more advanced topics. At the end of each chapter, it also includes programming exercises and quizzes. One suggestion I have for book’s organization is to delay the coverage of some class related topics including inheritance, polymorphism and interfaces to a later chapter. In addition, the coverage on data structures (stacks, queues and binary trees) may be expanded so the book could also be used in a second programming course in Java.","interface_rating":4,"interface_review":"The book’s interface is good and it is quite easy to navigate all book components. However, I feel the interface could be improved by adding a glossary and also an index.","grammatical_rating":5,"grammatical_review":"This is a very well-edited book.","cultural_rating":5,"cultural_review":"All examples and exercises from the book are very good and they are not culturally insensitive.","overall_rating":9,"overall_review":"Overall, this is a great book for introducing Java programming. It has a very decent coverage of all important foundational topics and provides clear explanations and nice examples and exercises. Plus, it is freely accessible. \r\n\r\nI will definitely consider using the book in some of my future classes.","created_at":"2021-04-18T05:17:10.000Z","updated_at":"2021-04-18T05:17:10.000Z"},{"id":5107,"first_name":"Zhenguang","last_name":"Gao","position":"Professor","institution_name":"Framingham State University","comprehensiveness_rating":5,"comprehensiveness_review":"The book covers all parts needed for a freshman course. It is can be used as one semester or one year book for Java programming.","accuracy_rating":5,"accuracy_review":"The syntax explanations are precise. The Java examples are error free.","relevance_rating":4,"relevance_review":"The book doesn't use the most recent version of Java Environment. However, I do not think that is a problem. Beginners do not need the up-to-date new syntax to do well in a problem solving course.","clarity_rating":5,"clarity_review":"The book is very concise, and easy to follow.","consistency_rating":5,"consistency_review":"The book is very well organized in style. Similar formats are used from the beginning to the end.","modularity_rating":4,"modularity_review":"The book follows the standard modularity for a first programming course. It begins with an introduction to computation, then followed by Java basics. It is a great book for a fast paced course. However, for some schools with a slow paced programming course, covering more basic programming skills and more examples could improve the learning experience.","organization_rating":4,"organization_review":"I feel the book should cover the basics in more details and more examples. The order of the some topics are not conventional.  For example, \"if\" structure is covered after the looping structures; and programming environment is in the last section of Chapter 2, not in the first section.","interface_rating":5,"interface_review":"The book is very easy to use. The website offers online, PDF, and other ways to navigate.","grammatical_rating":5,"grammatical_review":"I do not see any grammatical errors.","cultural_rating":4,"cultural_review":"The book doesn't not make use of a lot of examples relevant to races, ethnicity, or diversity. However, I did not see any culturally insensitive, or offensive content.","overall_rating":9,"overall_review":"I'd recommend the book for any one looking for a first year programming course.","created_at":"2021-06-15T20:24:22.000Z","updated_at":"2021-06-15T20:24:22.000Z"},{"id":34879,"first_name":"Tanvir Irfan","last_name":"Chowdhury","position":"Assistant Professor","institution_name":"Marshall University","comprehensiveness_rating":5,"comprehensiveness_review":"This book covers all the essential topics in Java development. It is not just for beginners; experienced programmers can also review the chapters for a quick reference. It can be used both as an introductory programming class using Java and also as upper level class that covers GUI programming using Java.","accuracy_rating":5,"accuracy_review":"I haven't seen any example with an obvious error. Having the source code available online for practice is a nice feature.","relevance_rating":5,"relevance_review":"Java is updated regularly. Although it is hard to keep up with the updates, I still think the book is using a fairly new version of Java. The reader will not miss much with the used version and if they want to learn the latest version, they can do it easily.","clarity_rating":4,"clarity_review":"The book is easy to follow and flows naturally from beginning to end. It introduces various concepts not generally seen in a programming language book, such as section 8.5, Analysis of Algorithms. While I appreciate the author's initiative, the example used in the first paragraph is rather exaggerated/dramatic (\"..correct answer after ten thousand years...\").","consistency_rating":5,"consistency_review":"The book uses consistent terminology throughout. All the codes/code segments were formatted using the same style. While the authors provided an explanation for using the term \"subroutine\" in chapter 4, I personally still think using the name \"method\" would be more beneficial for the reader.","modularity_rating":5,"modularity_review":"The book's modularity enables instructors of introductory Java programming courses to teach with ease. Instructors have the flexibility to select essential chapters while reserving more advanced topics for students at higher levels of proficiency.","organization_rating":5,"organization_review":"The book is organized in a logical fashion.","interface_rating":5,"interface_review":"Navigating the book is incredibly straightforward. The website provides various options such as online access, PDF downloads, and other convenient methods to explore its contents.","grammatical_rating":5,"grammatical_review":"I did not notice any obvious grammatical errors in my reading.","cultural_rating":5,"cultural_review":"While, I do not see examples of the inclusion of various races, ethnicities, and backgrounds. The most important thing is I also did not see any insensitive, or offensive content either. For the subject matter, I believe the book is perfectly fine.","overall_rating":10,"overall_review":null,"created_at":"2024-02-02T03:53:54.000Z","updated_at":"2024-02-02T03:53:54.000Z"}],"url":"https://open.umn.edu/opentextbooks/textbooks/introduction-to-programming-using-java-seventh-edition","updated_at":"2024-02-02T03:53:54.000Z"},{"id":453,"title":"Eloquent JavaScript: A Modern Introduction to Programming","edition_statement":null,"volume":null,"copyright_year":2014,"ISBN10":null,"ISBN13":"9781593275846","license":"Attribution-NonCommercial","language":"eng","description":"JavaScript lies at the heart of almost every modern web application, from social apps like Twitter to browser-based game frameworks like Phaser and Babylon. Though simple for beginners to pick up and play with, JavaScript is a flexible, complex language that you can use to build full-scale applications. This much anticipated and thoroughly revised third edition of Eloquent JavaScript dives deep into the JavaScript language to show you how to write beautiful, effective code. It has been updated to reflect the current state of Java¬Script and web browsers and includes brand-new material on features like class notation, arrow functions, iterators, async functions, template strings, and block scope. A host of new exercises have also been added to test your skills and keep you on track.","contributors":[{"id":4166,"contribution":"Author","primary":true,"corporate":false,"title":null,"first_name":"Marijn","middle_name":null,"last_name":"Haverbeke","location":null,"background_text":"Marijn Haverbeke is a programming language enthusiast and polyglot. He's worked his way from trivial BASIC games on the Commodore, through a C++ phase, to the present where he mostly hacks on database systems and web APIs in dynamic languages. He recently won the JS1K—JavaScript demo in 1024 bytes—contest, and is the author of a wide range of open-source software."}],"subjects":[{"id":3,"name":"Computer Science","parent_subject_id":null,"call_number":"QA76","visible_textbooks_count":137,"url":"https://open.umn.edu/opentextbooks/subjects/computer-science-information-systems"},{"id":59,"name":"Programming Languages","parent_subject_id":3,"call_number":"QA76","visible_textbooks_count":26,"url":"https://open.umn.edu/opentextbooks/subjects/programming-languages"}],"publishers":[{"id":372,"name":"No Starch Press","url":"http://eloquentjavascript.net/","year":null,"created_at":"2018-09-07T17:22:39.000Z","updated_at":"2020-01-03T04:40:23.000Z"}],"formats":[{"id":634,"format":"PDF","url":"https://eloquentjavascript.net/#links:~:text=Other%20pages","price":{"cents":0,"currency_iso":"USD"},"isbn":null},{"id":635,"format":"eBook","url":"https://eloquentjavascript.net/#links:~:text=Other%20pages","price":{"cents":0,"currency_iso":"USD"},"isbn":null},{"id":2044,"format":"Online","url":"https://eloquentjavascript.net/","price":{"cents":0,"currency_iso":"USD"},"isbn":null},{"id":2045,"format":"Hardcopy","url":"https://nostarch.com/ejs3","price":{"cents":0,"currency_iso":"USD"},"isbn":null}],"rating":"4.5","textbook_reviews_count":6,"reviews":[{"id":1294,"first_name":"Brian","last_name":"Bird","position":"Faculty","institution_name":"Lane Community College","comprehensiveness_rating":5,"comprehensiveness_review":"This book is quite comprehensive. It covers the features of the JavaScript language thoroughly as well as giving a complete explanation of the way JavaScript interacts with the DOM and the HTML 5 canvas. Advanced features like Modules are also presented. In addition there is a chapter on debugging as well as a section on  Node.js","accuracy_rating":5,"accuracy_review":"The book is very accurate. The author's explanations and descriptions are thorough and correct.","relevance_rating":4,"relevance_review":"This book was copyrighted in 2014 and is based on ECMAScript version 5. ECMAScript 6 was released in 2015 so the book is slightly out of date.","clarity_rating":5,"clarity_review":"The writing is lucid and includes some nice humor. Concepts are broken down and explained clearly and in a way that is accessible to readers without prior programming experience.","consistency_rating":5,"consistency_review":"Terms related to programming and JavaScript in particular are used consistently and accurately throughout the book.","modularity_rating":5,"modularity_review":"The books parts, chapters and sub-sections are divided logically and while the topics build on one another each section is well organized and cohesive.","organization_rating":5,"organization_review":"The book follows a fairly typical organization for a book on programming, stating with procedural concepts, then introducing functions, then objects. Chapter length projects are interspersed at regular intervals throughout the book to illustrate the concepts that have been presented.","interface_rating":5,"interface_review":"The book has a detailed table of contents and index with accurate page numbers. Diagrams and illustrations are clear and well done.","grammatical_rating":5,"grammatical_review":"I did not detect any grammar errors. The English is standard and does not reflect any regional dialect.","cultural_rating":5,"cultural_review":"The book mainly sticks to the technical details of JavaScript programming, but the author does use some entertaining stories, like the one about the Jacques the \"weresquirrel\", a man who turns into a squirrel after the sun goes down. He uses this story as a prop to discuss data sets. All the the stories are unoffensive and would be relevant to readers from most cultures.","overall_rating":10,"overall_review":"This is a very well written book that is accessible to beginning programmers but that will take them all the way to an advanced level of programming with JavaScript.","created_at":"2017-06-21T00:00:00.000Z","updated_at":"2017-06-21T00:00:00.000Z"},{"id":2118,"first_name":"Mary","last_name":"Lebens","position":"Instructor","institution_name":"Anoka Technical College","comprehensiveness_rating":4,"comprehensiveness_review":"“Eloquent JavaScript” is very comprehensive in its coverage of JavaScript. While most JavaScript textbooks cover only superficial examples of how to use JavaScript on the client side, such as validating forms and displaying alerts, this textbook explains the fundamental concepts of JavaScript as a programming language. This textbook covers fundamental programming concepts such as data types, operators, functions, and data structures. Then the book dives deep into how JavaScript interacts with the browser through the Document Object Model (DOM) and event handling. The only weakness in the coverage is that the book uses Node.js, which is a library for running JavaScript server-side, instead of one of the more popular JavaScript libraries like jQuery, React, or Angular. This book contains an index, but it does not contain a glossary, at least in the electronic version that was reviewed.","accuracy_rating":5,"accuracy_review":"The JavaScript code and the explanations of concepts are accurate. I tested several code examples in my browser, and they were error-free. The tone of the writing is neutral and unbiased.","relevance_rating":5,"relevance_review":"Since this textbook covers the fundamental programming structures of JavaScript as well as how the language is used for browser interaction, this book should remain relevant for a reasonably long period of time. The only section which may change quickly in relevancy is the section that focuses on the JavaScript library Node.js. JavaScript libraries come in and out of fashion quickly as developers adopt and discard them, so this section may be updated in a future edition of the textbook. In a future edition, I would love to see an additional instructor bank of materials, like quizzes, to accompany this textbook.\n","clarity_rating":4,"clarity_review":"The textbook describes concepts in a clear, straight-forward manner. This text is very readable, and the language approachable for a beginning programming student. The examples that are given illustrate the programming concepts lucidly. For example, Chapter 14 on the Document Object Model (DOM), the author gives the Hypertext Markup Language (HTML) for a simple web page, and then presents a diagram depicting how the HTML content is represented by the DOM.","consistency_rating":5,"consistency_review":"This textbook is consistent throughout in regards to terminology and general formatting. When multiple terms are used to describe the same concept, the author makes it clear that the two terms are interchangeable. This is helpful, and makes the terminology clearer for beginning students.","modularity_rating":5,"modularity_review":"Like most programming textbooks, this book starts with fundamental concepts, such as data types, and then progresses though more advanced concepts, such as data structures and control statements. The chapters shouldn’t be assigned in a non-sequential order, as this would break the logical progression of concepts for students. However, the book is broken into three large modules which could be assigned independent of each other: language, browser, and Node (the JavaScript library.)","organization_rating":5,"organization_review":"The text is logically organized, with the programming concepts building on one another like most standard software development textbooks. Each chapter is structured so that the exercises at the end of the chapter reinforce the chapter concepts. In addition, the author uses projects at intervals throughout the book to illustrate the concepts.\n","interface_rating":5,"interface_review":"The table of contents is accurate and the hyperlinks work well to direct the reader to the correct chapter. The diagrams and code are easy to read and free of distortions. ","grammatical_rating":5,"grammatical_review":"I found no grammar errors in this textbook.","cultural_rating":5,"cultural_review":"The book is written in standard English. The examples used to illustrate the coding concepts appear to be culturally neutral. The book seem like it would appeal to most readers, and the language was inoffensive.","overall_rating":10,"overall_review":"This book is an exciting new resource for teaching JavaScript, not only because the text is part of the Open Library, but because it is the only JavaScript book I've found which explains the concepts of the language using solid computer science concepts. The approach that this book takes of teaching students the fundamental concepts first will give students a solid footing before they dive into the web-specific features of JavaScript.","created_at":"2018-05-22T00:00:00.000Z","updated_at":"2018-05-22T00:00:00.000Z"},{"id":2356,"first_name":"Nicholas","last_name":"Caporusso","position":"Assistant Professor","institution_name":"Fort Hays State University","comprehensiveness_rating":4,"comprehensiveness_review":"The book contains a comprehensive and very detailed explanation of most of the fundamental concepts of Javascript. The author covers almost all the aspects of the language, from data types to asynchronous programming and promises. In addition to detailing how Javascript can be utilized in front-end design, the book introduces elements of server-side programming using NodeJS. Moreover, code snippets, examples, and projects help understand concepts and complete the theoretical overview.\r\nHowever, despite its comprehensiveness, the book could be more detailed regarding topics, such as, responsive design and front-end routing (e.g., using fragments). Moreover, it does not contain any reference to libraries, such as, jQuery, and to APIs. ","accuracy_rating":5,"accuracy_review":"Every topic in the book is discussed accurately and appears error-free. Moreover, most of the code attached to the book is well-indented and contains comments that increase its readability. In addition to being accurate and well-formatted, the code can be executed without any issues. The book is primarily available in many digital formats and the author appears to be very active and attentive in regard to fixing inaccuracies. Moreover, the website associated with the book contains a section that lists the errata and corrections for previous (printed) editions.","relevance_rating":4,"relevance_review":"As “Eloquent Javascript” contains a thorough overview of the fundamentals of the language, the core of its content is not expected to significantly change over the next years, which makes the book a durable resource for both students and instructors. However, as in the case of many programming languages, given the pace at which innovation happens in this domain, the longevity of the book could be affected by updates and by the development of new resources and libraries. Nevertheless, as the book received support from multiple backers, including the Mozilla foundation, the author appears to be continuously improving the content and the code: the book is already at its third edition.","clarity_rating":5,"clarity_review":"The book introduces and explains concepts concisely albeit very clearly. In addition to the multiple examples given every time a new argument is presented, the author included images that help grasp topics, though a richer use of figures would help. The presence of scripts and code snippets for almost every topic discussed in the book helps understand the theory and provides the reader with a boilerplate that can be utilized to get started and tinker with the tangible application of each concept. Furthermore, the author included complete projects, which create a framework that help realize how all the pieces come together.","consistency_rating":5,"consistency_review":"The book has good internal consistency overall, and its organization and content are in line with other books about Javascript, and programming languages, in general. This makes it easy to adopt the book even with a basic knowledge of programming, or to use it as an additional learning material, in combination with other resources. Concepts that are often referred to with multiple terms are clearly defined, and the presence of jargon is appropriately addressed using explanations that are consistent with other programming languages. As a result, the book can be utilized by readers who are already familiar with software development, as well as by individuals who are just starting.","modularity_rating":5,"modularity_review":"The modular organization of the book makes it easy to jump to a specific chapter and topic when needed, as topics have very little dependencies. Despite requiring knowledge of the basic aspects, every concept is designed as self-contained and, simultaneously, it is well-link to other arguments. As a result, the book is a great resource for the novice as well as for expert programmers.","organization_rating":5,"organization_review":"The structure of the book is consistent with the way programming languages are typically taught, and the organization of the chapters helps the reader absorb concepts and use them as building blocks. Numerous internal references help readers navigate the content and jump to definitions, when needed.","interface_rating":3,"interface_review":"The text is free of significant interface issues, including navigation problems, distortion of images/charts, and any other display features that may distract or confuse the reader.\r\nThe book structure is clear and easy to navigate, and the text does not contain any interface issues or elements that might distract the reader. Images are relevant, clear, and well organized, though they could be organized better.\r\nThe source code lacks syntax highlighting, which could improve code readability and, thus, increase the overall usability of the book. However, this is a minor flaw considering the abundance of online resources associated with the book.\r\n","grammatical_rating":5,"grammatical_review":"I didn’t find any grammatical errors or typos in the book.","cultural_rating":5,"cultural_review":"The book is written in English. Moreover, the website (http://eloquentjavascript.net) contains translations in Bulgarian, Portuguese, and Russian. Its content and examples are relevant and generally applicable regardless of any specific cultural background.","overall_rating":9,"overall_review":null,"created_at":"2018-11-05T03:49:13.000Z","updated_at":"2018-11-05T03:49:13.000Z"},{"id":4395,"first_name":"Anthony","last_name":"Marasco","position":"Assistant Professor","institution_name":"University of Texas Rio Grande Valley","comprehensiveness_rating":5,"comprehensiveness_review":"Eloquent JavaScript provides a thorough walkthrough of the core aspects of JavaScript as a coding language. Divided into three sections, the book sets a goal for each section to give the reader an understanding of what material, skills, and examples will be featured in each section. This helps to cover as much ground within a select subject as possible without becoming repetitive and diverting off into topics that are interesting but may not be essential for learning core coding procedures.","accuracy_rating":5,"accuracy_review":"This book—both in the explanatory, text portions and in the code examples—portrays accurate approaches to developing web applications and common computer science concepts through JavaScript. There are no errors that I noticed in either content or grammar throughout the book.","relevance_rating":5,"relevance_review":"This book provides what can sorely be missing from programming textbooks: a focus on the up-to-date, contemporary syntax for JavaScript. While many techniques for achieving goals through programming do not go out of date, the new advances of ES6 are covered in this book, allowing brand-new web developers to hit the ground running with a modern resource to work with.\r\n\r\nThe book is also available as an interactive webpage, a format that would allow the author to make edits and updates as new JavaScript conventions become standardized.","clarity_rating":5,"clarity_review":"This book is well written with both beginners and intermediary programmers in mind. It does not assume any previous computer science or programming experience and gradually builds on core concepts with each new chapter. New concepts and skillsets are introduced through references to the real world, which is crucial for beginning coders. Any sections that focus on terms or \"jargon\" are left for the later units, and chapters in those sections still make an effort to draw connections back to previous subjects and examples.","consistency_rating":5,"consistency_review":"The book does an excellent job of tying together examples and concepts across all units in the text.","modularity_rating":4,"modularity_review":"This book does a great job of making it easy to dive into one self-contained concept at a time, as it is well structured into large units focusing on the Language of JavaScript, how the Web Browser reacts to and translates JavaScript, and finally how networked web apps can communicate and share data using Node.js and client-server architecture. While the book makes it easy to choose which unit an instructor may want to tackle first in their class (say, covering the Web Browser unit before covering the in-depth aspects of the JavaScript language in Unit 1), the inter-unit chapters are organized in a more progressive liner manner. It would be difficult (but not impossible, due to the beginning \"recap\" text in each chapter) to cover the concepts of Objects and Classes in JavaScript without having covered the chapters on Data Types and Program Structure first. This issue has more to do with the intricacies of learning any new language than it does with the formatting of this textbook, but it does impact the pure modularity of the resource.","organization_rating":5,"organization_review":"The organization of material, concepts, and larger units are well thought out and presented.","interface_rating":5,"interface_review":"The textbook, particularly the interactive web version, is well designed and includes interactive code blocks where readers can edit and run the code directly inline with the text.","grammatical_rating":5,"grammatical_review":"No grammatical issues were found in either the written text or the code examples.","cultural_rating":5,"cultural_review":"This book includes multiple translation options through its web version, providing a contemporary resource to web development for non-English speakers.","overall_rating":10,"overall_review":null,"created_at":"2020-11-19T20:53:06.000Z","updated_at":"2020-11-19T20:53:06.000Z"},{"id":4626,"first_name":"Christian","last_name":"James","position":"Web Application Librarian","institution_name":"The Catholic University of America","comprehensiveness_rating":4,"comprehensiveness_review":"As an introduction to JavaScript, this book hits all the basics: variables, functions, arrays/objects, classes, etc. In addition, there are chapters on regular expressions, error handling, and Node JS. (The latter is curious, though, because it only goes over Node commands strictly, and doesn't discuss NPM or popular frameworks beyond a fleeting mention.) The book goes through all these topics pretty efficiently without becoming too much of a thick 'door-stopper' manual.","accuracy_rating":5,"accuracy_review":"After repeated readings, I've found no inaccuracies or errors in Eloquent JavaScript, 3rd Edition.\r\n\r\nWith regard to syntax, the author prefers using arrow functions, which may be more challenging to introductory-level readers rather than misleading.","relevance_rating":5,"relevance_review":"The book is very up-to-date, and uses newer aspects of JavaScript such as arrow functions, fetch, and \"let\" (for assigning variables within a function scope, as opposed to \"var\" or \"const\").\r\n\r\nThe chapter on Node JS also adds timely relevance, but it could have gone farther to discuss the popular use of frameworks like Express, React, Vue, etc.\r\n\r\nOne omission is that the book doesn't address the concept of Ajax. While the \"fetch\" command is used to make HTTP requests, it could have gone farther to explain how it is related (or, depending on your view, synonymous with) Ajax.","clarity_rating":2,"clarity_review":"Clarity is a weak point for Eloquent JavaScript. While some of the chapters are more straightforward and easy to understand, many of them become quickly dense and difficult. Once readers have grasped a basic understanding of core concepts, Haverbeke ramps up the skill level at too quick a pace. For example, in Chapter 11, we have barely understood the concepts of callbacks and promises when we get the advanced concepts of network flooding and message routing.\r\n\r\nThe examples, exercises, and Project chapters are too densely written and challenging for beginner or even intermediate readers. (Advanced readers, readers with a computer science background, or readers with intermediate experience in other programming languages may have a slightly less frustrating experience.) These should be opportunities to use practical, real-life scenarios, but (in addition to being too cryptically written), they are impractical (creating your *own* pixel art application from scratch) or even fantastic (i.e. the 'crow grid,' or 'observing the \"wererabbit\"'). This is a lost opportunity, but instructors using the textbook can easily use their own imagination to come up with exercises of their own. Unfortunately, it does come at a cost to the flow of the text for readers.","consistency_rating":3,"consistency_review":"As stated earlier, this book is inconsistent in its skill level. Instructors can likely adapt to this (as I have) by picking and choosing which chapters or selections to assign to students.\r\n\r\nAnother strategy for managing the inconsistency is by paying attention to the short, useful chapter summaries at the end of each chapter.","modularity_rating":5,"modularity_review":"Each chapter is a consistent (and appropriate) length. Each chapter has consistent, well-organized subheadings. It's easy to assign chapters or sections to students.","organization_rating":4,"organization_review":"The organization of the text obeys its own internal logic, even if it is not the logical series of topics that I use in my class. The book starts with values, operators, and variables, then functions, etc. HTML, web browsers, and HTTP isn't discussed until halfway through the book. This differs from my course, where I discuss the web at the beginning.\r\n\r\nAs long as instructors are up-front about this editorial decision, it won't throw off students very much.","interface_rating":5,"interface_review":"The web and print version of this book are both beautiful. The web version is readable and even elegant. The example interface works like a true browser console (even better, in fact), and is a valuable tool. The print version is sturdy; the weight is perfect and the paper stock is smooth but durable.\r\n\r\nAs of this review, I have not seen the e-book version.","grammatical_rating":5,"grammatical_review":"I have not seen any grammatical errors in Eloquent JavaScript.","cultural_rating":4,"cultural_review":"There are no direct cultural issues with Eloquent JavaScript. However, I do fear that the inconsistent difficulty level inserts a barrier to entry with this resource. I emphasize to my students that JavaScript is a great first programming to learn because you don't need to buy and install special software on your computer (your browser already has it installed!) and there are already free videos and resources out there to help you. When Haverbeke uses jargon or arcane examples, or ramps up the difficulty level, this could make students feel that *they* are incapable of grasping concepts that should, in fact, be accessible and within reach.\r\n\r\nAgain, while this is not specifically a cultural issue, I do worry that it could affect women or minorities who are already at a disadvantage in a field dominated by white and Asian men.","overall_rating":8,"overall_review":"I have taught an introductory JavaScript course with this textbook twice. Regardless of price, I believe this is the best single book on the market to teach JS. It's the most up-to-date and the least gimmicky. I love that there are chapters on regular expressions and the DOM, too, as those are particular interests of mine.\r\n\r\nAs noted above, however, this book is not without major flaws. Some of the chapters (in addition to the basics, they include the chapters on HTML forms, events, and the Document Object Model) are strong or even great. Others are just simply too difficult. The chapters on classes, debugging, for example, are strong but needlessly complicated. Entire chapters are dedicated to project examples that are completely incomprehensible to novices.\r\n\r\nThis inconsistency can be managed, especially when complemented with other course readings. I find that the strengths outweigh the weaknesses. I might even have assigned this book even if it didn't have a free online version, but that simply seals the deal for me.\r\n\r\nHopefully the author (or other publishers) will receive similar feedback and resolve the current edition's problems in subsequent editions.","created_at":"2021-02-18T21:17:45.000Z","updated_at":"2021-02-18T21:17:45.000Z"},{"id":34423,"first_name":"Laurie","last_name":"Alfaro","position":"Associate Professor","institution_name":"City Colleges of Chicago","comprehensiveness_rating":4,"comprehensiveness_review":"The book is divided into three parts, with each part building upon the concepts covered in the previous one. The first part focuses on the basics of JavaScript, including variables, data types, and control structures. The second part covers JavaScript for web development, including the DOM and event handlers. The final part of the book covers Node.js and includes a project chapter for building a web site.","accuracy_rating":3,"accuracy_review":"The author used terms that are not commonly used in JavaScript (i.e., \"binding\" instead of the more commonly used \"variable\"). Also, the author often uses let statements where the cay keyword would have been a more appropriate choice.","relevance_rating":3,"relevance_review":"By their very nature, books about scripting and coding languages will necessarily be obsolete in a short time. This is because coding standards are always evolving.","clarity_rating":5,"clarity_review":"This book would be appropriate for a beginning coding class, as the author explains basic terms which may be unfamiliar to new developers.","consistency_rating":5,"consistency_review":"The book is certainly consistent in structure and voice.","modularity_rating":4,"modularity_review":"Chapters are an appropriate length—not too long—and are structured for easy navigation. However, they are not modular in the sense that they could be taught in a different order than presented by the author.","organization_rating":5,"organization_review":"The book is organized with each chapter building upon the previous ones. This approach allows readers to learn JavaScript in a logical and progressive manner.","interface_rating":5,"interface_review":"I appreciated the use of the monospace font and color-coding in the code examples. This helps to distinguish the code from the surrounding text.","grammatical_rating":5,"grammatical_review":"I did not notice any grammatical errors.","cultural_rating":5,"cultural_review":"I found nothing inappropriate in the text.","overall_rating":9,"overall_review":null,"created_at":"2023-02-24T13:56:06.000Z","updated_at":"2023-02-24T13:56:06.000Z"}],"url":"https://open.umn.edu/opentextbooks/textbooks/eloquent-javascript-a-modern-introduction-to-programming","updated_at":"2024-01-22T14:52:18.000Z"},{"id":497,"title":"Introduction to MIPS Assembly Language Programming","edition_statement":null,"volume":null,"copyright_year":2016,"ISBN10":null,"ISBN13":null,"license":"Attribution","language":"eng","description":"This book was written to introduce students to assembly language programming in MIPS. As with all assemblylanguage programming texts, it covers basic operators and instructions, subprogram calling, loading andstoring memory, program control, and the conversion of the assembly language program into machine code. However this book was not written simply as a book on assembly language programming. The larger purposeof this text is to show how concepts in Higher Level Languages (HLL), such as Java or C/C++, arerepresented in assembly. By showing how program constructs from these HLL map into assembly, theconcepts will be easier to understand and use when the programmer implements programs in languages likeJava or C/C++. Concepts such as references and variables, registers, binary and Boolean operations, subprogram execution, memory types (heap, stack, and static), and array processing are covered to clarify thedecisions made when implementing HLL. Program control is presented using a mapping from structuredprograms in pseudo code to help students understand structured programming, and why it exists. Memoryaccess in assembly is presented to high light the difference between references (pointers) and values, and howthese impact HLL. This book has numerous code examples, and many problems at the end of each chapter, and it is appropriate for a class in Assembly Language, or as a extra resource for a class in Computer Organization.","contributors":[{"id":4308,"contribution":"Author","primary":true,"corporate":false,"title":null,"first_name":"Charles","middle_name":null,"last_name":"Kann","location":"Gettysburg College","background_text":"Charles Kann is an Adjunct Professor in the Computer Science department at Gettysburg College, Gettysburg, PA"}],"subjects":[{"id":3,"name":"Computer Science","parent_subject_id":null,"call_number":"QA76","visible_textbooks_count":137,"url":"https://open.umn.edu/opentextbooks/subjects/computer-science-information-systems"},{"id":59,"name":"Programming Languages","parent_subject_id":3,"call_number":"QA76","visible_textbooks_count":26,"url":"https://open.umn.edu/opentextbooks/subjects/programming-languages"}],"publishers":[{"id":437,"name":"Charles W. Kann III","url":"http://cupola.gettysburg.edu/cgi/viewcontent.cgi?article=1001\u0026context=oer","year":null,"created_at":"2018-09-07T17:22:39.000Z","updated_at":"2020-01-03T05:31:16.000Z"}],"formats":[{"id":749,"format":"PDF","url":"https://cupola.gettysburg.edu/oer/2/","price":{"cents":0,"currency_iso":"USD"},"isbn":null}],"rating":"4.5","textbook_reviews_count":2,"reviews":[{"id":2000,"first_name":"MD TAMJIDUL ","last_name":"HOQUE","position":"Assistant Professor","institution_name":"University of New Orleans","comprehensiveness_rating":5,"comprehensiveness_review":"Starting from basic information needed for MIPS assembly language programming using MARS IDE, the text covers MIPS arithmetic and logical operators, memory model of MIPS, control structures, recursion, and array, and so on in grater details.","accuracy_rating":5,"accuracy_review":"I could not spot errors - it seems that the proof read was done very well.","relevance_rating":4,"relevance_review":"There was a lacking for a sharable and good programming guide for students for MIPS programming using MARS IDE. This book fulfills the need.","clarity_rating":5,"clarity_review":"The book is well written - specially, in hierarchical manner in terms of difficulty; i.e., it starts showing the basic steps and problem and then gradually dives deeper. This will help students engaged longer while reading the text.","consistency_rating":5,"consistency_review":"The book is organized in a consistent manner chapter-wise as well as within the chapter, concept-wise.","modularity_rating":5,"modularity_review":"The book is easy to read because it is presenting the text in a hierarchical manner in terms of difficulty. Also, for complex cases, illustrations have been provided.","organization_rating":5,"organization_review":"The topic and the text are organizes in a logical and consistent manner. ","interface_rating":5,"interface_review":"I don't find any interface issues including the navigation problem.","grammatical_rating":5,"grammatical_review":"I did not spot any grammatical error.","cultural_rating":5,"cultural_review":"The book has perhaps nothing to do with culture, thus it is non-applicable for this book. It is a good book, thus I am scoring accordingly.","overall_rating":10,"overall_review":"The illustrations or the drawing could be made looking nicer. I understand it is time consuming - but sometimes simpler figure may provide a bad feeling to the naive students. Perhaps, 3D drawing components in power-point, word or visio could be easily used.","created_at":"2018-05-22T00:00:00.000Z","updated_at":"2018-05-22T00:00:00.000Z"},{"id":4349,"first_name":"Ranjidha","last_name":"Rajan","position":"Affiliate Faculty","institution_name":"Metropolitan State University of Denver","comprehensiveness_rating":5,"comprehensiveness_review":"The book covers both theoretical concepts and step by step assembly language programming using MARS Simulator. It covers topics  like Number representations, MARS IDE,MIPS architecture, Programming using arithmetic and logical operators to assembly programming to arrays, Instruction representations and MIPS memory .","accuracy_rating":5,"accuracy_review":"The information I read was accurate.","relevance_rating":4,"relevance_review":"Considering new CPU are designed every year there are room for updates. For undergraduate students this is a great book for MIPS programming using MARS IDE.","clarity_rating":5,"clarity_review":"The book does seem to provide a good amount of context, programmes and picture demos.","consistency_rating":4,"consistency_review":"The book topics are consistent and easy to follow.","modularity_rating":5,"modularity_review":"The Author did a great job of dividing concepts and information into required sections.","organization_rating":5,"organization_review":"Well organized ,starting from simple topics and scaffolding to complex ones.","interface_rating":4,"interface_review":"There is no issues in navigation. The code examples are nicely presented. Few IDE images are hard to read, I think this is the only way we can include the whole image of the IDE.","grammatical_rating":5,"grammatical_review":"No errors.","cultural_rating":5,"cultural_review":"The language used for explaining theory is English which is used in most academic books worldwide. There is no accessible issues found. The main constructs are focused on Assembly programming which has no cultural references. Examples taken also have no cultural references as the book is dealing with language of computer processors.","overall_rating":9,"overall_review":"Adding interactive components, practice questions and test bank will help the students to get better learning experience.","created_at":"2020-09-01T21:14:18.000Z","updated_at":"2020-09-01T21:14:18.000Z"}],"url":"https://open.umn.edu/opentextbooks/textbooks/introduction-to-mips-assembly-language-programming","updated_at":"2024-01-22T14:51:57.000Z"},{"id":733,"title":"x86-64 Assembly Language Programming with Ubuntu","edition_statement":null,"volume":null,"copyright_year":2019,"ISBN10":null,"ISBN13":null,"license":"Attribution-NonCommercial-ShareAlike","language":"eng","description":"The purpose of this text is to provide a reference for University level assembly language and systems programming courses. Specifically, this text addresses the x86-64 instruction set for the popular x86-64 class of processors using the Ubuntu 64-bit Operating System (OS). While the provided code and various examples should work under any Linux-based 64-bit OS, they have only been tested under Ubuntu 14.04 LTS (64-bit). The x86-64 is a Complex Instruction Set Computing (CISC) CPU design. This refers to the internal processor design philosophy. CISC processors typically include a wide variety of instructions (sometimes overlapping), varying instructions sizes, and a wide range of addressing modes. The term was retroactively coined in contrast to Reduced Instruction Set Computer (RISC3).","contributors":[{"id":4906,"contribution":"Author","primary":false,"corporate":false,"title":null,"first_name":"Ed","middle_name":null,"last_name":"Jorgensen","location":"University of Nevada","background_text":"Ed Jorgensen"}],"subjects":[{"id":3,"name":"Computer Science","parent_subject_id":null,"call_number":"QA76","visible_textbooks_count":137,"url":"https://open.umn.edu/opentextbooks/subjects/computer-science-information-systems"},{"id":59,"name":"Programming Languages","parent_subject_id":3,"call_number":"QA76","visible_textbooks_count":26,"url":"https://open.umn.edu/opentextbooks/subjects/programming-languages"}],"publishers":[{"id":712,"name":"Ed Jorgensen","url":"http://www.egr.unlv.edu/~ed","year":null,"created_at":"2019-06-22T20:16:16.000Z","updated_at":"2020-08-30T20:19:25.000Z"}],"formats":[{"id":1250,"format":"PDF","url":"http://www.egr.unlv.edu/~ed/assembly64.pdf","price":{"cents":0,"currency_iso":"USD"},"isbn":null}],"rating":"4.5","textbook_reviews_count":2,"reviews":[{"id":3980,"first_name":"Mehrdad","last_name":"Nourai","position":"Assistant Professor","institution_name":"Framingham State University","comprehensiveness_rating":4,"comprehensiveness_review":"The book seems to cover many details of x86-64 Assembly, however, it does not teach how to program.","accuracy_rating":5,"accuracy_review":"The information I read was accurate.","relevance_rating":4,"relevance_review":"In the field of computer science, some books can become outdated within a year. Considering new CPU are designed every year, this book may need to be updated yearly.","clarity_rating":4,"clarity_review":"The book does seem to provide a good amount of context and technical information about CPU and hardware.","consistency_rating":4,"consistency_review":"The book topics are consistent.","modularity_rating":5,"modularity_review":"I am giving full score for this one, since the author did a great job of dividing concepts and information into logical sections.","organization_rating":5,"organization_review":"Similar to Modularity, I am giving full score for organization of this book.","interface_rating":4,"interface_review":"The interface is more or less fine.","grammatical_rating":4,"grammatical_review":"I am giving 4 on this one, since some statements could a have been written a bit shorter.","cultural_rating":4,"cultural_review":"I did not see any cultural insensitive issue.","overall_rating":9,"overall_review":"Overall, it is a great reference book.","created_at":"2020-06-14T04:58:10.000Z","updated_at":"2020-06-14T04:58:10.000Z"},{"id":4452,"first_name":"Hassan","last_name":"Salmani","position":"Associate Professor","institution_name":"Howard University","comprehensiveness_rating":4,"comprehensiveness_review":"The book presents a good coverage of x86-64 Assembly Language Programming. The book also provides some practical details regarding the execution of x86-64 instructions under the Ubuntu operating system. Further, each chapter of the book includes some exercises and suggested projects that help the reader to understand the material covered in a chapter.","accuracy_rating":5,"accuracy_review":"It is accurate.","relevance_rating":5,"relevance_review":"The subject is important in computer engineering and computer science fields considering the widespread electronic systems in human life and the importance of developing efficient programs for electronic systems.","clarity_rating":4,"clarity_review":"The book strives to present a subject as simple as possible without overloading its readers. Further, the book pays attention to the font size of the text such that a reader becomes comfortable with the text.","consistency_rating":5,"consistency_review":"It is consistent.","modularity_rating":5,"modularity_review":"The subject is divided into a good number of chapters with reasonable sizes.","organization_rating":5,"organization_review":"The book has a good organization, and subjects are presented in a good flow. It introduces some basics such as data representation, then it describes the instruction set. The book focuses on more advanced and complex subjects such as system services and interrupts.","interface_rating":5,"interface_review":"The interface is fine.","grammatical_rating":4,"grammatical_review":"The book is easy to read, meanwhile, it has room for improvement.","cultural_rating":5,"cultural_review":"The book does not contain any cultural insensitive issue.","overall_rating":9,"overall_review":"The book can serve as a good reference. A reader can significantly benefit from the book if its sample codes become available online. Dedicating a website for the book with an embedded virtual environment to practice the coding would enhance educational outcomes.","created_at":"2020-12-14T14:45:28.000Z","updated_at":"2020-12-14T14:45:28.000Z"}],"url":"https://open.umn.edu/opentextbooks/textbooks/x86-64-assembly-language-programming-with-ubuntu","updated_at":"2024-04-29T13:12:45.000Z"},{"id":734,"title":"MIPS Assembly Language Programming using QtSpim","edition_statement":null,"volume":null,"copyright_year":2017,"ISBN10":null,"ISBN13":null,"license":"Attribution-NonCommercial-ShareAlike","language":"eng","description":"There are a number of excellent, comprehensive, and in-depth texts on MIPS assembly language programming. This is not one of them.The purpose of this text is to provide a simple and free reference for university level programming and architecture units that include a brief section covering MIPS assembly language programming. The text assumes usage of the QtSpim simulator. An appendix is included that covers the download, installation, and basic use of the QtSpim simulator.The scope of this text addresses basic MIPS assembly language programming including instruction set usage, stacks, procedure/function calls, QtSpim simulator system services, multiple dimension arrays, and basic recursion.","contributors":[{"id":4909,"contribution":"Author","primary":false,"corporate":false,"title":null,"first_name":"Ed","middle_name":null,"last_name":"Jorgensen","location":"University of Nevada","background_text":"Ed Jorgensen"}],"subjects":[{"id":3,"name":"Computer Science","parent_subject_id":null,"call_number":"QA76","visible_textbooks_count":137,"url":"https://open.umn.edu/opentextbooks/subjects/computer-science-information-systems"},{"id":59,"name":"Programming Languages","parent_subject_id":3,"call_number":"QA76","visible_textbooks_count":26,"url":"https://open.umn.edu/opentextbooks/subjects/programming-languages"}],"publishers":[{"id":713,"name":"Ed Jorgensen","url":"http://www.egr.unlv.edu/~ed","year":null,"created_at":"2019-06-29T14:33:43.000Z","updated_at":"2020-08-30T20:20:09.000Z"}],"formats":[{"id":1251,"format":"PDF","url":"http://www.egr.unlv.edu/~ed/MIPStextSMv11.pdf","price":{"cents":0,"currency_iso":"USD"},"isbn":null}],"rating":null,"textbook_reviews_count":0,"reviews":[],"url":"https://open.umn.edu/opentextbooks/textbooks/mips-assembly-language-programming-using-qtspim","updated_at":"2024-04-29T13:12:45.000Z"},{"id":735,"title":"Introduction to Programming using Fortran 95/2003/2008","edition_statement":null,"volume":null,"copyright_year":2018,"ISBN10":null,"ISBN13":null,"license":"Attribution-NonCommercial-ShareAlike","language":"eng","description":"Computers are everywhere in our daily lives. Between the desktop, laptop, phone, bank, and vehicle, it is difficult to completely get away from computers. It only makes sense to learn a little about how a computer really works.This text provides an introduction to programming and problem solving using the Fortran 95/2003/2008 programming language. This introduction is geared for non-computer science majors. The primary focus is on an introduction to problem solving and algorithm development. As such, many details of the Fortran 95/2003/2008 language are omitted.","contributors":[{"id":4910,"contribution":"Author","primary":false,"corporate":false,"title":null,"first_name":"Ed","middle_name":null,"last_name":"Jorgensen","location":"University of Nevada","background_text":"Ed Jorgensen"}],"subjects":[{"id":3,"name":"Computer Science","parent_subject_id":null,"call_number":"QA76","visible_textbooks_count":137,"url":"https://open.umn.edu/opentextbooks/subjects/computer-science-information-systems"},{"id":59,"name":"Programming Languages","parent_subject_id":3,"call_number":"QA76","visible_textbooks_count":26,"url":"https://open.umn.edu/opentextbooks/subjects/programming-languages"}],"publishers":[{"id":714,"name":"Ed Jorgensen","url":"http://www.egr.unlv.edu/~ed","year":null,"created_at":"2019-06-29T15:09:02.000Z","updated_at":"2020-08-30T20:21:34.000Z"}],"formats":[{"id":1252,"format":"PDF","url":"http://www.egr.unlv.edu/~ed/fortranv3.pdf","price":{"cents":0,"currency_iso":"USD"},"isbn":null}],"rating":"4","textbook_reviews_count":1,"reviews":[{"id":33445,"first_name":"Patrick","last_name":"Slattery","position":"Adjunct Professor","institution_name":"New York City College of Technology","comprehensiveness_rating":4,"comprehensiveness_review":"With respect to legacy Fortran programming the book does an excellent job of covering the ideas of the subject appropriately and provides an effective index.  If the book is intended to be focused on novice programmers or those simply interested in programming the structure of the material may result in a steep learning curve as the content does not build from simple premises (e.g. \"Hello World\") on upwards.  As a refresher for those who were familiar with Fortran long ago, the structure of the material is effective.","accuracy_rating":5,"accuracy_review":"I found the content to be accurate and error-free.  Some concepts could be presented more clearly, succinctly, or effectively for novice readers.","relevance_rating":3,"relevance_review":"This is not an easy area to assess with respect to a book about Fortran programming.  After all, how relevant is Fortran programming?  In some fields and environments, it may be a necessity but that is different from relevant.  Given the subject matter, the author tries to make the material relevant.  One example is the discussion of a free, open-source compiler available for Fortran users.  The challenge there is that the online resources provided by the group supporting the free compiler are obtuse and may present cybersecurity and other risks.  \r\n\r\nAnother area where the material could be more relevant is in the area of object-oriented programming which, as I understand it, has been a part of the language since Fortran 2003.  \r\n\r\nFinally, some forward-thinking with respect to the potential for Fortran in parallel processing, perhaps on GPUs, would be of interest.","clarity_rating":4,"clarity_review":"The writing style leans more toward academic than toward the instructional or advisory style which novice programmers would prefer.  There are some good examples used but they tend to be more typical, academic examples such as The Tower of Hanoi or Monte Carlo simulation.  There will be some young, modern readers with an interest in those examples, but not many. \r\n\r\nThe writing also includes some academic ornaments such as footnotes for simple terms, etc.  Those are likely to slow novice readers down and may reduce interest in continuing to read the material.","consistency_rating":5,"consistency_review":"Consistency is the book's forte.","modularity_rating":5,"modularity_review":"The modularity of the book makes it manageable to both read and use in instruction, though in some cases that modularity may present a challenge in developing concepts and bring novice readers along.","organization_rating":4,"organization_review":"Is the book presented in a logical, clear fashion?  Yes.\r\nDoes that work best for the target audience?  I am inclined to think that the structure could be improved to make the book more accessible, enjoyable, and effective for novice programmers.","interface_rating":3,"interface_review":"I read the book in both e-reader and .PDF format and while it was not confusing there were areas where the structure and style of the book could have worked better with it's interface.  Lists which span page breaks are challenges in many places.  The style of presenting sample code seemed lacking.  More and better graphics would also have been an improvement.\r\n\r\nI was not able to read a printed, bound copy of the book and cannot comment on that physical interface.","grammatical_rating":5,"grammatical_review":"There were no meaningful grammatical errors of note to me, though I did not keep detailed note of any if I found them.  There are areas where the structure of sentences could be more effective if it were direct in some cases, losing superfluous phrases, and more colorful or descriptive in other places.","cultural_rating":4,"cultural_review":"The text is not culturally insensitive, but it would certainly benefit from including more inclusive perspectives, examples, and anecdotes.","overall_rating":8,"overall_review":"I came to book Introduction to Programming Using Fortran 95/2003/2008 with pent-up interest, keen to dust off nearly half a century of the lost art.   Added to a misplaced sense of nostalgia was some curiosity about how Fortran might be experiencing a rebirth in areas such as parallel processing on Graphical Processing Units (GPUs) and the addition of object-oriented capabilities since Fortran 2003.  \r\nI wanted to read a Fortran book!\r\n\r\nStructurally, the material could use some feedback from a focus group of newbie programmers or those interested in programming.  I imagine too many novices dropping off before they make it through the first 20% of the book to reach a simple ‘Hello World’ example.  The current structure worked well for me as it seemed to group content by category and was an effective way to present a refresher.\r\n\r\nI found the book valuable and developed an interest in seeing Fortran evolve and become more accessible and useful to modern programmers.  I imagined a world where there could be such a thing as an online, browser-based platform for writing and running Fortran code – akin to a Google Colab.  Given all the activity in the cryptocurrency space, I still wonder if there isn’t room for some Fortran code in the parallel processing aspects of mining or as functions or services accessed by smart contracts.  \r\n\r\nI want more!","created_at":"2021-11-03T19:57:10.000Z","updated_at":"2021-11-03T19:57:10.000Z"}],"url":"https://open.umn.edu/opentextbooks/textbooks/introduction-to-programming-using-fortran-95-2003-2008","updated_at":"2024-04-29T13:12:45.000Z"},{"id":1372,"title":"Programming Persistent Memory: A Comprehensive Guide for Developers","edition_statement":null,"volume":null,"copyright_year":2020,"ISBN10":null,"ISBN13":null,"license":"Attribution","language":"eng","description":"Beginning and experienced programmers will use this comprehensive guide to persistent memory programming. You will understand how persistent memory brings together several new software/hardware requirements, and offers great promise for better performance and faster application startup times—a huge leap forward in byte-addressable capacity compared with current DRAM offerings. This revolutionary new technology gives applications significant performance and capacity improvements over existing technologies. It requires a new way of thinking and developing, which makes this highly disruptive to the IT/computing industry. The full spectrum of industry sectors that will benefit from this technology include, but are not limited to, in-memory and traditional databases, AI, analytics, HPC, virtualization, and big data. Programming Persistent Memory describes the technology and why it is exciting the industry. It covers the operating system and hardware requirements as well as how to create development environments using emulated or real persistent memory hardware. The book explains fundamental concepts; provides an introduction to persistent memory programming APIs for C, C++, JavaScript, and other languages; discusses RMDA with persistent memory; reviews security features; and presents many examples. Source code and examples that you can run on your own systems are included. What You’ll Learn Understand what persistent memory is, what it does, and the value it brings to the industry Become familiar with the operating system and hardware requirements to use persistent memory Know the fundamentals of persistent memory programming: why it is different from current programming methods, and what developers need to keep in mind when programming for persistence Look at persistent memory application development by example using the Persistent Memory Development Kit (PMDK) Design and optimize data structures for persistent memory Study how real-world applications are modified to leverage persistent memory Utilize the tools available for persistent memory programming, application performance profiling, and debugging Who This Book Is For C, C++, Java, and Python developers, but will also be useful to software, cloud, and hardware architects across a broad spectrum of sectors, including cloud service providers, independent software vendors, high performance compute, artificial intelligence, data analytics, big data, etc.","contributors":[{"id":6167,"contribution":"Author","primary":true,"corporate":false,"title":null,"first_name":"Stteve","middle_name":null,"last_name":"Scargall","location":null,"background_text":"Steve Scargall is a persistent memory software/cloud architect within Intel’s Data Center Group (DCG). He contributes to the SNIA NVM Programming Technical Work Group, PMDK, NDCTL, and other open sources projects. With more than 18 years of enterprise application and filesystem IO performance analysis, Steve now works on the exciting and disruptive bleeding edge of persistent memory application design solutions. He works with ISVs and CSPs to enable and deliver persistent memory solutions."}],"subjects":[{"id":3,"name":"Computer Science","parent_subject_id":null,"call_number":"QA76","visible_textbooks_count":137,"url":"https://open.umn.edu/opentextbooks/subjects/computer-science-information-systems"},{"id":59,"name":"Programming Languages","parent_subject_id":3,"call_number":"QA76","visible_textbooks_count":26,"url":"https://open.umn.edu/opentextbooks/subjects/programming-languages"}],"publishers":[{"id":1350,"name":"Apress","url":"https://www.apress.com/us","year":null,"created_at":"2023-03-13T18:09:50.000Z","updated_at":"2023-03-13T18:09:50.000Z"}],"formats":[{"id":3462,"format":"PDF","url":"https://link.springer.com/content/pdf/10.1007/978-1-4842-4932-1.pdf?pdf=button%20sticky","price":{"cents":0,"currency_iso":"USD"},"isbn":null},{"id":3463,"format":"eBook","url":"https://link.springer.com/download/epub/10.1007/978-1-4842-4932-1.epub","price":{"cents":0,"currency_iso":"USD"},"isbn":"978-1-4842-4932-1"},{"id":3464,"format":"Hardcopy","url":"https://link.springer.com/book/10.1007/978-1-4842-4932-1?page=2#toc","price":{"cents":4999,"currency_iso":"USD"},"isbn":"978-1-4842-4931-4"}],"rating":null,"textbook_reviews_count":0,"reviews":[],"url":"https://open.umn.edu/opentextbooks/textbooks/programming-persistent-memory-a-comprehensive-guide-for-developers","updated_at":"2024-01-22T19:19:40.000Z"}],"links":{"self":"https://open.umn.edu/opentextbooks/textbooks?page=1\u0026q=Programming","total_pages":9,"total_count":87,"next":"https://open.umn.edu/opentextbooks/textbooks?page=2\u0026q=Programming"}}